

     #|=========================================|
     #|    Quiz 3                               |
     #|    Part B                               |
     #|    numpy data analysis -->  2D array    |
     #|    Author: Khashayar Alipour            |
     #|=========================================|

#________________________________________________________________________________________________________________________

# مرحله اول = 5 تا محصول داریم که میخوایم فروش همه این محصولات رو در 30 روز نشان بدیم. فروش باید بین 0 تا 100 باشه

# مرحله دوم = اینهارو حساب کن
# مجموع فروش هر روز    
# مجموع فروش هر محصول    
# میانگین فروش روزانه هر محصول    
# بیشترین فروش ثبت شده در کل ماتریکس    
# اندیس (روز و محصول) بیشترین فروش رو پیدا کن    


# مرحله سوم:
    # 1- پیدا کردن روزی که بیشترین فروش کل رو داشتیم    
    # 2- محصولی که کمترین فروش کل رو داشته    
    # 3- روزایی که مجموع فروش بیشتر از میانگین کل فروش بوده    
    # 4- فروش هارو نرمال کن (بین 0 تا 1)    



import numpy as np

# =================== [ First Step ] ======================

products = np.random.randint(0,100,(5,30))
# products.ndim --> 2
print("products: ",products)
'''
[[26 82 90 13 92 61  8 34 35 71 37 30 71 59 19 61 11 90 85 15 44 69 33 23 61  7 22 50 72 70]
 [36  3 13 90 47 59  8 24 24 41 95  4 99 31 20 77  4 51 76 99 60 23 95 66 17 64 65 59 11 51]
 [24 30 71 67 21  2 32 46 82 11  5 93 16 90 38 25 46  9 20 27 92 28 70 57 20 69 50 66 30 55]
 [21 91 57 88 28 68 66 38 48 77  7  0 90 30 10 31 76 15 17 78  4 73 36 29 94 17 88 89 55 73]
 [54 71 70  2 24 50 28 90 12 82 38 60 36 33 64 18 95 33 76 75 86 24 90 16 68 85 44 42 50 84]]
'''
print("============================")



# =================== [ Second Step ] ======================


# ------- مجموع فروش هر روز -------
everyday_sale = products.sum(axis=0)
# این یک آرایه خروجی میده که 30 تا المنت داره
# هر المنت مجموع ستونهای هر روز هست
# وقتی میگیم axis=0 یعنی روی ردیف افقی حرکت میکنه و ستونها رو باهم جمع میکنه
# result = [sum column1, sum column2, sum column3, ..., sum column 30]

print("مجموع فروش هر روز: ", everyday_sale)
# مجموع فروش هر روز:  [161 277 301 260 212 240 142 232 201 282 182 187 312 243 151 212 232 198 274 294 286 217 324 191 260 242 269 306 218 333]
print("============================")



# -------مجموع فروش هر محصول-------
product1 = sum(products[0,:])
print("فروش ماهانه محصول 1: ", product1)   # فروش ماهانه محصول 1:  1441
product2 = sum(products[1,:])
print("فروش ماهانه محصول 2: ", product2)   # فروش ماهانه محصول 2:  1412
product3 = sum(products[2,:])
print("فروش ماهانه محصول 3: ", product3)   # فروش ماهانه محصول 3:  1292
product4 = sum(products[3,:])
print("فروش ماهانه محصول 4: ", product4)   # فروش ماهانه محصول 4:  1494
product5 = sum(products[4,:])
print("فروش ماهانه محصول 5: ", product5)   # فروش ماهانه محصول 5:  1600
print("============================")




# -------میانگین فروش روزانه هر محصول-------
product1_avg = int(sum(products[0,:])/30)
print("میانگین فروش روزانه محصول 1: ", product1_avg)    # میانگین فروش روزانه محصول 1:  48
product2_avg = int(sum(products[1,:])/30)
print("میانگین فروش روزانه محصول 2: ", product2_avg)    # میانگین فروش روزانه محصول 2:  47
product3_avg = int(sum(products[2,:])/30)
print("میانگین فروش روزانه محصول 3: ", product3_avg)    # میانگین فروش روزانه محصول 3:  43
product4_avg = int(sum(products[3,:])/30)
print("میانگین فروش روزانه محصول 4: ", product4_avg)    # میانگین فروش روزانه محصول 4:  49
product5_avg = int(sum(products[4,:])/30)
print("میانگین فروش روزانه محصول 5: ", product5_avg)    # میانگین فروش روزانه محصول 5:  53
print("============================")



# -------بیشترین فروش ثبت شده در کل ماتریکس-------
max_sale = products.max()
# اگه مثلا بگیم max(axis=0) میاد بیشترین فروش در هر ستون رو حساب میکنه
# و همچنین axis=1 بیشترین فروش در هر ردیف


print("بیشترین فروش ثبت شده در کل ماتریکس: ", max_sale)    # بیشترین فروش ثبت شده در کل ماتریکس:  99
print("============================")




# -------اندیس (روز و محصول) بیشترین فروش رو پیدا کن-------
shape = products.shape
a = np.argmax(products)
b = np.unravel_index(a,shape)
day = b[1]
product = b[0]

# argmax() --> اندیسِ خطیِ بیشترین مقدار را می‌دهد
# یعنی اگه ماتریس بصورت (5,30) باشه از 0 تا 149 اندیس داریم               
# این تابع میاد اول ماتریکس رو flat میکنه و بعد میگه المنتی که max هست عدد اندیسش چی هست               
# unravel_index (argmax, shape) --> همان اندیس خطی را تبدیل می‌کند به (سطر، ستون)


print(f"بیشترین میزان فروش در روز {day} برای محصول {product} میباشد")    # بیشترین میزان فروش در روز 12 برای محصول 1 میباشد
print("============================")





# =================== [ Third Step ] ======================

# 1- -------پیدا کردن روزی که بیشترین فروش کل رو داشتیم-------

# b = [row,column] = [product, day] --> b[0]=product | b[1]=day
print("روزی که بیشترین فروش را داشتیم: ",np.unravel_index(a,shape)[1])    # روزی که بیشترین فروش را داشتیم:  12
print("============================")



# 2- -------محصولی که کمترین فروش کل رو داشته-------

monthly_sale = products.sum(axis=1)
c = np.argmin(monthly_sale)
# max() --> مقدار بزرگ‌ترین عدد را میده
# argmax() --> اندیس بزرگ‌ترین عدد را می‌دهد

# max() <-> min()
# argmax() <-> argmin()

print(f"محصولی که کمترین فروش را در کل ماه داشته: محصول شماره {c+1}")    # محصولی که کمترین فروش را در کل ماه داشته: محصول شماره 3
print("============================")




 # 3- -------روزایی که مجموع فروش بیشتر از میانگین کل فروش بوده-------
 
monthly_average_sale = int(np.floor(np.mean(products.sum(axis=0))))
print("میانگین فروش در یک ماه: ",monthly_average_sale)    # میانگین فروش در یک ماه:  241
daily_sale = products.sum(axis=0)
more_than_avg_sale = []
for index,item in enumerate(daily_sale):
    if item>monthly_average_sale:
        more_than_avg_sale.append(index+1)
    
print("روزهایی که مجموع فروش از میانگین کل فروش ماهانه بیشتر بوده: ",more_than_avg_sale)     # روزهایی که مجموع فروش از میانگین کل فروش ماهانه بیشتر بوده: [2, 3, 4, 10, 13, 14, 19, 20, 21, 23, 25, 26, 27, 28, 30]
print("============================")




# 4- -------فروش هارو نرمال کن (بین 0 تا 1) - min max normalization-------

# min max Normalization --> (x - min) / (max - min)
# x = داده اصلی   |  max= بزرگترین مقدار داده ها  |  min= کوچکترین مقدار داده ها
# نرمال کردن یعنی بازه از 0 تا 1 باشه و هر عددی غیر از min و max یک عدد در بازه 0 و 1 باشه

daily_sale = products.sum(axis=0)
min_sale = daily_sale.min()
max_sale = daily_sale.max()
sale_range = max_sale - min_sale
normalization = np.round((daily_sale-min_sale) / sale_range, 1)    # نتیجه نهایی را تا یک رقم اعشار گرد کن
print("normalization: ",normalization)

'''
[0.1 0.7 0.8 0.6 0.4 0.5 0.  0.5 0.3 0.7 0.2 0.2 0.9 0.5 0.  0.4 0.5 0.3 0.7 0.8 0.8 0.4 1.  0.3 0.6 0.5 0.7 0.9 0.4 1. ]
'''





