

     #|=========================================|
     #|    Quiz 3                               |
     #|    Part C                               |
     #|    numpy data analysis --> 3D array     |
     #|    Author: Khashayar Alipour            |
     #|=========================================|

#________________________________________________________________________________________________________________________

# یک خط صنعتی 8 سنسور داریم که 24 ساعته هر دقیقه داره داده ثبت میکنه:
    # یعنی 24 ساعت    
    # هر ساعت 60 دقیقه    
    # 8 سنسور    
    # (24,60,9)
    
    
    # مرحله اول - تولید داده:
    # build a 3D array with shape(24,60,9)
        # مقادیر یک normal distribution با میانگین 50 باشه و انحراف معیار 10 داشته باشه    

# مرحله دوم - تحلیل زمانی:
    # 1- محاسبه میانگین هر سنسور در کل روز    
    # 2- محاسبه میانگین هر ساعت (روی همه سنسورها)    
    # 3- محاسبه ساعتی که بیشترین میانگین رو داره    
    # 4- محاسبه واریانس هر سنسور    
    # 5- پیدا کردن سنسوری که بیشترین نوسان رو داشته    
  
    
  
    
import numpy as np

# =================== [ First Step ] ======================

data = np.round(np.random.normal(50,10,(24,60,9)), 1)   # mean=50, standard deviation=10, shape=(24,60,9)
print(data)

# data.ndim --> 3D
# data.shape -->(24,60,9)
# 24 = rows --> برابر 24 ساعت - این ماتریس 24 ردیف داره که هر ردیف میشه 1 ساعت
# 60 = minutes --> یعنی در هر ساعت 60 ردیف داده داریم --> هر ردیف = یک دقیقه
# 9 = sensors --> یعنی در هر دقیقه، 9 مقدار مختلف داریم (هر سنسور یک مقدار)

# شکل 3 بعدی این داده اینجوری میشه:
    # یک بعد 24 ساعت    
    # یک بعد 60 دقیقه    
    # یک بعد نوسانات سنسور    
    # حالا از همین شکل، 9 تا داریم (به تعداد سنسورها)    

# Hour 0:
    # Minute 0 -> [s1 s2 s3 ... s9]    
    # Minute 1 -> [s1 s2 s3 ... s9]    
    # ...
    # Minute 59    

# Hour 1:
    # Minute 0 -> [s1 s2 s3 ... s9]    
    # ...

  
'''
[[[41.7 40.4 54.1 ... 52.  41.4 54.7]
  [41.3 63.6 58.3 ... 39.5 66.9 54.6]
  [49.6 41.3 60.  ... 52.6 44.4 57.5]
  ...
  [51.  54.2 44.3 ... 38.1 54.8 66.5]
  [27.9 42.2 60.6 ... 52.3 52.5 43.3]
  [33.6 43.9 71.2 ... 53.8 62.6 66.1]]

 [[37.2 55.8 38.9 ... 51.2 53.8 45.3]
  [61.2 27.3 57.2 ... 53.6 58.4 61.2]
  [63.1 41.2 49.  ... 66.4 53.1 54.5]
  ...
  [60.8 50.7 57.  ... 52.2 64.  54.1]
  [47.  60.2 34.  ... 58.2 59.8 52.1]
  [45.4 52.6 48.8 ... 50.9 56.8 45.8]]

 [[53.9 57.3 37.1 ... 54.1 48.6 47.1]
  [25.5 31.2 43.2 ... 45.8 46.  52.9]
  [42.6 43.9 44.5 ... 54.1 45.1 47.4]
  ...
  [62.5 47.9 51.9 ... 53.8 41.6 43.5]
  [58.9 44.9 49.7 ... 47.6 59.9 42.4]
  [46.1 36.4 55.5 ... 34.1 48.1 52.2]]

 ...

 [[65.8 44.4 62.9 ... 52.  53.9 61.7]
  [47.3 44.9 35.6 ... 50.7 40.9 50.1]
  [38.4 41.8 59.1 ... 42.7 46.2 55.5]
  ...
  [58.1 47.2 25.4 ... 41.3 49.7 55.4]
  [45.4 55.8 35.2 ... 29.1 35.4 37.5]
  [43.7 58.6 56.  ... 50.3 51.  28.9]]

 [[55.3 47.1 33.  ... 64.5 44.9 82.4]
  [49.3 36.3 28.3 ... 56.6 36.2 68.7]
  [58.3 47.2 57.9 ... 48.5 39.  51.5]
  ...
  [44.4 50.1 47.9 ... 52.3 57.3 47.1]
  [40.  47.2 47.6 ... 43.6 61.8 35.9]
  [58.3 56.  72.3 ... 51.7 58.8 55.8]]

 [[51.7 48.6 44.1 ... 50.9 39.1 40. ]
  [69.5 39.2 55.8 ... 32.3 52.9 63.2]
  [59.6 42.9 47.7 ... 52.9 66.9 44.6]
  ...
  [51.  46.  57.6 ... 47.3 41.2 70.8]
  [68.9 52.  61.5 ... 46.  53.8 46.8]
  [45.7 56.5 40.2 ... 42.5 52.4 55.2]]]
'''





# =================== [ Second Step ] ======================

 # 1- --------محاسبه میانگین هر سنسور در کل روز--------

# راه axis selection
# در numpy وقتی می‌خوای یک بُعد حذف بشه، روی آن بُعد باید aggregation انجام بدی (مثل mean)    
# اگر می‌خوای نتیجه برای "یک بُعد خاص" باشه، باید روی بقیه بُعدها میانگین بگیری    
# پس بُعد سنسور باید نگه داشته شود و دو بُعد دیگر (زمان) باید حذف شوند    
    # axis=0 -> ساعت \ axis=1 -> دقیقه \ axis=2 -> سنسور
    
# پس باید به تابع mean دوتا Axis رو بدیم و این دوتا axis که بهش دادیم رو حذف میکنه و axis سوم میمونه
# تابع mean در حالت عادی اینجوریه -> np.mean(array, axis=None)
# اگه بخوایم بیشتر از یک axis بهش بدیم -> np.mean(array, axis=(1,2))  و در این حالت axis 1 و 2 حذف میشن و 3 میمونه
# important!    axis=(1,2) درست      axis=1,2 غلط
# axis=int → حذف یک بُعد
# axis=(int, int, ...) → حذف چند بُعد همزمان
# output = بُعدهایی که باقی مانده‌اند


sensor_mean = np.round(np.mean(data, axis=(0,1)),1)    # این خط برای هر سنسور، همه مقادیرش در تمام ساعات و دقیقه‌ها را جمع می‌کند و میانگین می‌گیرد
# sensor_mean.shape --> 9   دو بعد دیگه حذف شدن
print("میانگین هر سنسور در یک روز: ",sensor_mean)      # میانگین هر سنسور در یک روز:  [50.  49.8 49.9 50.1 50.4 49.9 49.7 50.1 50.3]





# 2- --------محاسبه میانگین هر ساعت (روی همه سنسورها)--------

hour_mean = np.round(np.mean(data, axis=(1,2)),1)     # این خط یعنی برای هر ساعت، همه داده‌های 60 دقیقه × 9 سنسور را با هم میانگین بگیر
print("میانگین هر ساعت: ",hour_mean)
'''
 [50.8 49.3 50.4 50.3 49.2 50.2 50.5 50.2 49.5 49.7 50.2 49.5 49.9 50.4
 50.2 50.1 49.5 50.3 49.6 50.2 50.  49.6 50.4 50.6]
'''



 # 3- --------محاسبه ساعتی که بیشترین میانگین رو داره--------

# میانگین ساعت هارو (24 تا) حساب میکنیم
# حالا میگه از بین این 24 تا ساعت کدومش بیشترین میانگین رو داره؟
# پیدا کردن اندیسی که بیشترین مقدار را دارد

hour_mean = np.mean(data, axis=(1,2))
max_hour_mean = np.argmax(hour_mean)
print(f"ساعتی که بیشترین میانگین رو داره ساعت {max_hour_mean+1} هست")    # ساعتی که بیشترین میانگین رو داره ساعت 1 هست
 
 
 


# 4- --------محاسبه واریانس هر سنسور--------

# واریانس فقط سنسور (فقط یک Axis) رو میخوایم
# پس باید بقیه بعدها حذف بشن و همونی که میخوایم بمونه

sensor_variance = np.round(np.var(data, axis=(0,1)),1)
print("واریانس هر سنسور: ",sensor_variance)    # واریانس هر سنسور:  [101.8  92.7 104.7 101.2 101.4 110.5  98.2 102.6 103.8]
    
    
    
    
# 5- --------پیدا کردن سنسوری که بیشترین نوسان رو داشته--------

# نوسان = واریانس
# بین این 9 سنسور، کدام یکی بیشترین نوسان را دارد؟

sensor_variance = np.var(data, axis=(0,1))
max_sensor_variance = np.argmax(sensor_variance)
print(f"سنسوری که بیشترین نوسان رو داره: {max_sensor_variance+1}")    # سنسوری که بیشترین نوسان رو داره: 6




