

     #|=========================================|
     #|    Quiz 4                               |
     #|    Part D                               |
     #|    matplotlib                           |
     #|    Author: Khashayar Alipour            |
     #|=========================================|

#________________________________________________________________________________________________________________________

# مرحله اول:
    # تولید داده با توزیع نرمال با میانگین=0 و واریانس=1 و shape(1000,)    


# مرحله دوم - تحلیل آماری:
    # محاسبه میانگین    
    # محاسبه واریانس    
    # محاسبه کمینه    
    # محاسبه بیشینه    
    
    
# مرحله سوم - رسم نمودار:
    # رسم نمودار هستوگرام از داده ها    
    # رسم نمودار cumulative sum    
    
    
# =============================================================================


import numpy as np
import matplotlib.pyplot as plt


# ============================ [first step] ===================================
data = np.random.normal(0,1,(1000,))

# سوال گفته «واریانس = 1» و در تابع normal پارامتر دوم انحراف معیار است نه واریانس. چون:
# Variance=(Standard Deviation)**2   -->   پس اگر واریانس 1 باشد، انحراف معیار هم 1 می‌شود



# ============================ [second step] ===================================

mean = np.mean(data)
variance = np.var(data)
minimum = np.min(data)
maximum = np.max(data)



# ============================ [third step] ===================================

# نمودار هیستوگرام
plt.hist(data, bins=50, color="orange")
plt.grid()
plt.show()



# cumulative sum یا جمع تجمعی

# اگه مثلا داده های ما این باشن: [2, 5, 3, 1]    
# جمع تجمعی اینطوری میشه:    
    # [2,
    # 2+5,
    # 2+5+3,     ==>   [2, 7, 10, 11]
    # 2+5+3+1]

# برای رسم نمودار برای این داده بهتره از نمودار خطی استفاده بشه:    
    # محور x → شماره نمونه‌ها (0 تا 999)       
    # محور y → مقدار جمع تجمعی تا آن لحظه       
    
cum = np.cumsum(data)
plt.plot(cum, color="orange")
plt.xlabel("items")
plt.ylabel("cumulative sum")
plt.grid()
plt.show()














