# -*- coding: utf-8 -*-

#   ==========================================================================
#   =============       Created on Tue Jun  2 20:41:39 2026      =============
#   =============            Author: KhashayarAlipour            =============
#   =============                 License: MIT                   =============
#   =============                                                =============
#   =============             Linear Algebra (جبر خطی)           =============
#   ==========================================================================





'''
   ___________________
   |                 |
   |     VECTOR      |
   |_________________|
'''

# Magnitude: یک عدد خالی که جهتی نداره. مثلا میگیم یک موشک با سرعت 700 کیلومتر بر ساعت داره میره
           # این عدد جهت خاصی رو نشون نمیده و فقط یک مقدار هست             
             # Magnitude -> no directon / only quantity  

# Vector: الان یک بردار رسم شد که هم جهت داره و هم مقدار که بهش میگیم وکتور
# Magnitude + Direction =>  +700km/h   یعنی با سرعت 700 در جهت بالا
# پس وکتور یک بردار هست که از چندتا scaler تشکیل شده و یک جهت داره (به سمت بالا | به سمت پایین)
# وکتورها از نظر بعد 3 گروه میشن:
    # 1D --> [num]
    # 2D --> [num, num]
    # 3D --> [num, num, num]
    
# در عمل وکتور یک numpy array 1D هست:
    # numpy array 1D => Vector [s]  [s,s]  [s,s,s]

#       y
#       |
#       |      (x=3, y=4)
#       |     /
#       |    /
#       |   /
#       |  /
#       | /
#       |/_______________________ x
#                 2D Vector

# هر وکتور 2بعدی یک نقطه در فضای 2 بعدی هست که از مبدا (0,0) یک بردار بهش وصل میشه
import numpy as np
a = np.array([3,4])   # 2D vector - فقط یک نقطه




#       y
#       |
#       |      (x=3, y=5, z=1)
#       |     /
#       |    /
#       |   /
#       |  /
#       | / 
#       |/_______________________ x
#        \         3D Vector
#         \
#          \
#           \
#            \
#            Z

b = np.array([3,5,1])




#   ________________________
#   |   Norm of a vector   |
#   ========================

# norm of a vector (u) noted ||u|| is measure of lenght (magnitude) of u

# حالا norm چطوری محاسبه میشه؟
# vector = [scaler, scaler, scaler, scaler, ...]  هر وکتور از چندین اسکالر تشکیل شده
# دونه دونه اسکالرها رو به توان 2 میرسونیم + و به علاوه همدیگه میکنیم (زیگما) و ازش رادیکال بگیریم میشه norm یک وکتور
# ||u|| = radical [zigma ui**2]
# اینها تقریبا باهم یک معنی رو میدن: norm - magnitude - اندازه - lenght
v = np.array([3,4])
norm_v = np.linalg.norm(v)
# linalg = linear algebra    .norm(ورودی یک وکتور بهش میدیم)
# 3**2=9 | 4**2=16 | 9+16=25 | radical 25 = 5    پس نُرم یا اندازه این بردار میشه 5

# طول (lenght) یک بردار چند نوع داریم
# The most common is euclidian (اقلیدسی) Norm
    

# حالا پشت صحنه تابع norm که از linalg در numpy میگیریم چطوریه؟
import numpy as np
import math

def norm(vector):
    #chck mikone numpy
    # chan bodie
    # print(vector.size)
    # print(vector.shape)
    
    n_size = vector.size
    scaler_squared = []
    
    for i in range(0, n_size):
        scaler_squared.append(vector[i]**2)
        
    scaler_zigma = sum(scaler_squared)
    vector_norm = math.sqrt(scaler_zigma)
    return vector_norm    



#   ________________________
#   |   vector operations  |
#   ========================

# 1- Addition
# اگه دوتا وکتور سایز برابر داشته باشن میشه باهم جمعشون کنیم    
# عملیات جمع بصورت دونه دونه یا element wise انجام میشه    
    # خروجی addition یک وکتور هست    
    # vector addition is commutative --> یعنی u+v = v+u
    # vector addition is associative --> یعنی u+(v+w) = (u+v)+w
    #  [2, 5]     np.array([2, 5])
    #  [3, 1]     np.array([3, 1])
    # --------    v_sum = v1 + v2 = [x=5, y=6]
    #  [5, 6]
    
    #   y                      y                  y
    #   |                      |                  |      [5,6]
    #   |                      |                  |      /
    #   |    [2,5]             |                  |     /
    #   |    /                 |                  |    /
    #   |   /                  |   [3,1]          |   /
    #   |  /                   |  /               |  /
    #   | /                    | /                | /
    #   |/___________ x        |/__________ x     |/___________ x
    
    

# 2- Multiplication by scaler
    # وقتی یک scaler چیزی درش ضرب میشه میگیم scaled شده    
    # حالا Scale شدن میتونه بصورت بزرگنمایی باشه یا کوچک نمایی    
    # اگه در عدد بزرگتر از 1 ضرب بشه میشه بزرگنمایی و زیر 1 باشه میشه کوچک نمایی    
    # خروجی scaler multiplication یک وکتور هست    
    v = [1,2]
    v_scaled = 3*v
    print(v_scaled)    # [x=3, y=6]   بزرگ نمایی شده



# 3- dot product (ضرب داخلی)
# برعکس دو مورد بالایی، خروجی این یک Scaler هست یعنی بهمون عدد میده    
    # dot product in commutative -->   u.v = v.u    
    # dot product is nooot associative --> (u.v).w برابر نیست با u.(w.v)

    # حالا تابع dot که از numpy میگیریمش در پشت صحنه چطوری کار میکنه؟    
# مثلا دوتا وکتور با نام u و v داریم    
    # u.v= ||u|| * ||v|| * cos(theta)
# اینجا theta چیه؟ زاویه‌ای هست که بین دو بردار u و v هست    

    def dot(u,v, theta_u_v=0):
        # ...
        # یک تابعی هست که زاویه بین u و v رو حساب میکنه که میشه theta_u_v        
        u_norm = norm(u)
        v_norm = norm(v)        
        dot = u_norm * v_norm * math.cos(theta_u_v)
        return dot

    u = np.array([2,5])
    v = np.array([3,1])
    np.dot(u,v)   #11







'''
   _____________________
   |                   |
   |     Matrices      |
   |___________________|
'''

# numpy array 0D -> scaler - یک عدد خالی
# numpy array 1D -> vector - [s]  [s,s]  [s,s,s]
# numpy array 2D -> matrix - [ [radif 1], [radif 2] ]

matrix_a = np.array([ [1,2], [3,4] ])
#  [[1,2]
#   [3,4]]

# مشخصه ماتریکس (اندازش) = ردیف * ستون
# ماتریکس 2 در 2 یعنی 2 ردیف و 2 ستون

matrix_a.shape    # [2,2]
matrix_a.size     # 4  میگه چنتا عدد داخلش هست

# دسترسی به ردیف (مثلا ردیف اول)
matrix_a[0]   # array([1,2])

#  دسترسی به ستون
matrix_a[0,0]   # 0     ردیف اول ستون اول
matrix_a[:,0]   # [1,3]    همه ردیف‌ها ستون اول


# ---Identity matrix---
np.eye(3)
#  [[1,0,0]
#   [0,1,0]
#   [0,0,1]]


# ---Zero matrix---
np.zeros((2,3))
#  [[0,0,0]
#   [0,0,0]]


# ---Diagonal matrix---
np.diag([4,5,6])
#  [[4,0,0]
#   [0,5,0]
#   [0,0,6]]

np.diag([3,4,5], k=1)   # offset
#  [[0,3,0,0]
#   [0,0,4,0]
#   [0,0,0,5]
#   [0,0,0,0]]



#   ________________________
#   |   Matrix operations  |
#   ========================

# 1- Adding
# ازونجایی که جمع در ماتریک بصورت element wise انجام میشه بنابراین برای جمع دو ماتریکس باید هم اندازه باشن    
    # commutative --> a+b=b+a
    # associative --> a+(b+c) = (a+b)+c
    a = np.array([1,2], [3,4])
    b = np.array([5,6], [7,8])
    print(a+b)
    #      a           b           a+b
    #   [[1,2]      [[5,6]       [[6,8]
    #    [3,4]]      [7,8]]       [10,12]]



# 2- scaler multiplication
    # یعنی یک Scaler (عدد) در یک ماتریک ضرب بشه    
    # element wise multiplication
    
    #      a       3*a
    #   [[1,2]    [[3,6]
    #    [3,4]]    [9,12]]
    
    

# 3- Matrix multiplication
    # if Matrix 1 = (m*n)  / matrix 2 = (k*z)
    # فقط درصورتی میشه در مورد بالا دو ماتریکس رو باهم ضرب کرد که n=k باشه    
    # یعنی تعداد ردیف ماتریکس اول برابر تعداد ستون ماتریکس دوم باشه    
    
    # این نوع ضرب commutative نیست --> یعنی a*b برابر نیست با b*a    
    # این نوع ضرب associative هست --> یعنی q*(r*s) = (q*r) *s    
    # It is also distributive --> (q+r)*s = q*s + r*s
    
    # نوع ضرب در اینجا دیگه element wise نیست    
    # میاد از ماتریک اولی ردیف برمیداره، از ماتریکس دوم ستون برمیداره و حالا اینارو element wise ضرب میکنه باهم    
    # حاصل هر مرحله از این ضرب و جمع ردیف و ستون‌ها باهم، میشه یک المنت از ماتریکس نتیجه    
    
    # مثال از ضرب ماتریکس (2*2) در (2*3)    
    a = np.array([1,2], [3,4])         # ماتریکس 2*2
    b = np.array([1,2,3], [4,5,6])     # ماتریکس 2*3
    #     a          b                        a*b
    #   [1,2]     [1,2,3]      [(1*1 + 2*4), (1*2 + 2*5), (1*3 + 2*6)]      [9,12,15]
    #   [3,4]     [4,5,6]      [(3*1 + 4*4), (3*2 + 4*5), (3*3 + 4*6)]      [19,26,33]
    
    # این نوع ضرب همون چیزی هست که با تابع Dot میتونیم حساب کنیم    
    # c = a.dot(b)
    #  [9,12,15]
    #  [19,26,33]
    
    # راه دیگه برای ضربِ خارجیِ دوتا ماتریکس اینجوریه:    
        # c = a@b
        # c = b@a --> error
    
    # اگه بخوایم این دو ماتریکس رو بصورت عادی ضربِ داخلیِ element wise کنیم:    
        # c = a * b  --> error
        # چون size و shape این دو ماتریکس برابر نیست        
        
    
    
# 4- Matrix transpose
    # میاد ماتریکس رو برعکس میکنه    
    # (q+r)*T = qT + rT
    # (Q*R)T = rT * qT 
    
    a = np.array([1,2], [3,4])
    #     a        a.T
    #   [1,2]     [1,3]
    #   [3,4]     [2,4]
    
    

# 5- Matrix determinant
# ستون آخر و ردیف آخر رو پاک میکنه    
# از چیزی که میمونه میاد ضربدری المنت‌های یک جهت رو در هم ضرب میکنه و از ضرب المنت‌های جهتِ دیگه کم میکنه    
# در مرحله بعد میاد ردیف و ستون 2 رو حذف میکنه و بازم همون عملیات رو روی هرچی که میمونه اعمال میکنه    
# همینطوری از آخر به اول ردیف و ستون مرحله به مرحله حذف میشه و روی هرچی که میمونه همون عملیات ضرب و تفریق انجام میشه    
    # در انتها هر عددی که در هر مرحله بدست میاد رو باهم جمع میکنیم که میشه دترمینان این ماتریکس    

    a = np.array([1,2,3]
                 [4,5,6]
                 [7,8,9])
    #    first step         second step        |    Round 2                             |   Round 3
    # delete   delete         [1 2]            |  delete  delete     [1 9]              | delete  delete      [5 6]
    #   [3]   [7 8 9]         [4 5]            |   [2]   [4 5 6]     [7 3]              |   [1]   [1 2 3]     [8 9]
    #   [6]               (1*5) - (2*5) = M1.1 |   [5]            (1*3) - (9*7) = M2.2  |   [4]            (9*5) - (8*6) = M3.3
    #   [9]                                    |   [8]                                  |   [7]
    # determinant_a = M1.1 + M2.2 + M3.3

    # بجای همه این کارها میشه با تابع det از linalg سریع دترمینان هر تابعی خواستیم رو حساب کنیم    
        result = np.linalg.det(a)   # -9.516183782398e-16

# حالا کاربرد دترمینان چیه؟    
# مثلا در مبحث quation system با استفاده از دترمینان میتونیم بفهمیم که آیا فلان ماتریکس invertible هست یا نه        
# و آیا سیستم یک راه حل منحصر به فرد داره یا نه        
    # اگر دترمینان=0 بشه یعنی ماتریکسی که ما داریم singular هست و invertible نیست        
        invertible= np.linalg.inv(a)














    
    
    
    
    
    

