
'''

Author: Khashayar Alipour   |   Year: 2026   |   License: MIT
        __________________
       |       Linux     |
       ==================
       
       Cheatsheet:  https://quera.org/college/cheatsheet/linux
'''





'''   _____________________
     |                    |
     |   What is Shell?   |
     |____________________|
'''


# شل به عنوان یک واسط عمل می‌کند که ورودی را از طریق کیبورد از کاربر می‌گیرد
# و با توجه به ورودی، برنامه‌ای را برای اجرا به سیستم‌عامل می‌فرستد.
# در لینوکس، شما می‌توانید از طریق یک ترمینال، به شل دسترسی پیدا کنید.
# یعنی شما ابتدا ترمینال خود را باز می‌کنید، ترمینال نیز برایتان شل پیش فرضتان را اجرا می‌کند.

# معروف ترین شل‌های لینوکس:  bash, sh, zsh, fish

# برای مشاهده شل پیش‌فرض در سیستم لینوکس خود در ترمینال مینویسیم:
    # echo $SHELL  ->  /usr/bin/bash


# تفاوت علامت # و $ در ترمینال چیست؟؟
# علامت # به معنی این هست که دسترسی شما در حالت کاربر root یا superuser هستش
# علامت $ هم که حالت معمولی هستش


#       ___________________        process       ___________      echo hello      ___________________     command      _______
#      |                   |    <-----------    |           |   <------------    |                   |  <----------   |       |                          
#      |  Oerating System  |                    |   SHELL   |                    |  Terminal (bash)  |                |  User |
#      |___________________|    ----------->    |___________|   ------------->   |___________________|  ----------->  |_______|
#                                  response                         hello                                 response





'''   ____________________________
     |                           |
     |  Working with terminal    |
     |___________________________|
'''

# opening a new terminal in ubuntu:
    # ctrl + alt + t
    
# opening a new tab in terminal
    #  T + shift + ctrl
    # clicking on + in top-right corner
    
# moving between tabs in terminal
    # PgDn + ctrl و PgUp + ctrl
    
# clearing terminal page:
    # L + ctrl
    # clear
    
# viewing command history in terminal:
    # history
    # history 5  =>  یعنی 5 دستور آخر
    
# clearing command history:
    # history -c










'''   ____________________________
     |                           |
     |  Linux Command structure  |
     |___________________________|
'''

# ساختار کلی دستورات لینوکس به این صورته:
    # COMMAND [OPTIONS] [ARGUMENTS]

# لینوکس در هر 3 بخش بالا case sensitive هست

# COMMAND
# این قسمت دستوری است که به سیستم‌عامل داده می‌شود   
# هر دستور یک برنامه است که به سیستم‌عامل می‌گوید تا کار‌هایی را انجام دهد   

# OPTION
# در این قسمت، صفر یا تعدادی آپشن گذاشته می‌شود   
#  آپشن‌ها گاهی با یک خط تیره و گاهی با دو خط تیره نمایش داده می‌شوند   
# به کمک آپشن‌ها می‌توانیم از حالات مختلف یک دستور بهره ببریم   
#  به طور مثال دستور pwd --help راهنمای دستور pwd را نمایش می‌دهد   

# ARGUMENTS
# در این بخش، صفر یا تعدادی آرگومان برای COMMAND نوشته می‌شود   
# این آرگومان‌ها ورودی‌های مورد نیاز برای COMMAND هستند   
# مثلا در این دستور echo hello دستور اصلی Echo هست و آرگومان hello هست   




# LONG FORMAT \ SHORT FORMAT
# اغلب آپشن‌های دستورها دارای این دو حالت هستن   

# حالت short format با - شروع می‌شوند و تک حرفی هستند   
# برای مثال در دستور ls آپشن‌های -a و -l همگی در حالت short format هستند   
# بعضی آپشن‌ها تنها دارای حالت short format هستند، برای مثال در man page دستور ls آپشن -f به این صورت است   

# حالت long format با -- شروع می‌شوند و چند حرفی هستند   
# برای مثال در دستور ls آپشن --all در حالت long format است   
# برخی آپشن‌ها تنها دارای حالت long format هستند، برای مثال آپشن --author به این صورت است   
   
# تفاوت مهم این دو حالت در استفاده هم‌زمان آن‌هاست   
# برای مثال اگر در دستور ls اگر قصد استفاده همزمان از سه آپشن -l و -t و -r را داشتیم:   
   # ls -l -t -r
   # ls -ltr
# تنها در حالتی که قصد استفاده همزمان از چند آپشن short format را داشته باشیم می‌توانیم تک حروف آن‌ها را پشت هم بیاوریم   






'''   ___________________________________
     |                                  |
     |   Linux command general guide    |
     |__________________________________|
'''

# نحوه یادگیری عمیق‌تر هر دستور
# به طور کلی 3 روش برای آشنایی با هر دستور لینوکس وجود داره

# --help option
    # ls --help مثلا
    # این آپشن برای عموم دستورات لینوکس وجود داره    
# در قسمت Usage، نحوه استفاده از دستور نوشته شده‌است    


# info command
    # info ls
    # دستور info برای عموم دستورات لینوکس دارای توضیحاتی است    
# در این‌حالت، با فشردن کلید جهت‌های رو به بالا و پایین می‌توانید درون محتوای خروجی دستور جا‌به‌جا شوید    
# با فشردن کلید q می‌توانید از صفحه خارج شوید    

# man command
    # man ls
    # برای تمامی دستورات لینوکس دارای توضیحات کاملی است    
#  این روش بهترین نحوه آشنایی با دستورات جدید است    
    # در صفحه man page چند قسمت برای توضیحات داریم    
    # در بخش NAME در این بخش نام دستور معرفی شده (ls = ist directory contents)         
    # در بخش SYNOPSIS  نحوه استفاده از دستور بیان شده (ls [options]...[files])         
# در بخش DESCRIPTION خود دستور مورد نظرمان و تمامی آپشن‌های آن توضیح داده شده‌است         
        
        # بخش‌های AUTHOR و REPORTING BUGS و COPY RIGHT و SEE ALSO         
        # به ترتیب به نویسنده دستور، نحوه اطلاع‌رسانی باگ‌های دستور، قوانین مربوط به حق نشر دستور و لینک‌های مفیدی برای بررسی بیشتر دستور اشاره دارند         





'''   _________________
     |                |
     |  pwd - cd - ls |
     |________________|
'''


# directory                     ____ file 1
#    |_______ subdirectory ____|____ file 2
#    |
#    |_______ subdirectory ____ empty

# شما در هر لحظه درون یک دایرکتوری قرار دارید که به آن (Current Directory) می‌گوییم.
# /home/<USERNAME>



''' pwd (print working directory) '''
# home/cpc


''' cd (change directory) '''

# دو نوع آدرس دهی داریم
# 1- Absolute Path:
    # cd /home/CPC/Desktop  -> desktop
# 2- Relative PAth:
    # cd Desktop/  -> desktop

# cd ..

# در هرجای سیستم که باشید، اگر بخواهید به دایرکتوری خانه اکانت‌تان (/home/<USERNAME>) بروید:
    # cd ~

# با اینم مستقیم میریم دسکتاپ:
    # cd ~/Desktop
    
# مثلا میخوایم از اینجا /home/quera/Desktop/ بریم اینجا /home/quera/Downloads/:
    # cd ../Downloads
    # cd ~/Downloads/



'''
      ls 
'''

# اگه فقط دستور ls بدون هیچ آرگومانی باشه -> محتوای دایرکتور فعلی
    # ls
    
# مشاهد محتوای یک دایرکتوری مشخص
    # ls /name

# در صورت استفاده با آپشن t-، نتایج بر اساس زمان آخرین تغییرات (modification time) مرتب می‌شوند
    # ls -t  =>  a.py  b.py  c.py


# در صورت استفاده با این آپشن l-، نتایج دقیق‌تر نمایش داده می‌شوند
# جزئیاتی از قبیل یوزر سازنده فایل‌ها، دسترسی‌ و حجم فایل‌ها، زمان آخرین تغییرات روی فایل‌ها و ...
    # ls -l
        # total 48   =>   مجموع حجم بلاک‌های حافظه برای فایل‌ها
        #-rw-rw-rw-. 1 root root    14 Oct 19  2024 a.py
        # -rw-rw-rw-. 1 root root    13 Oct 19  2024 b.py
        
        # ستون اول مربوط به دسترسی فایل‌ها و دایرکتوری‌هاست        
        # ستون دوم تعداد هاردلینک‌ ها میباشد       
# ستون سوم و چهارم به ترتیب نام یوزر و نام گروه آن یوزری که فایل یا دایرکتوری را ساخته نمایش می‌دهد       
# ستون پنجم حجم فایل‌ها را به بایت نمایش می‌دهد       
# ستون ششم و هفتم و هشتم به ترتیب ماه و روز و ساعت آخرین تغییرات روی فایل‌ها       


 # آپشن h-  =>  مخفف human readable
# باید حتما این آپشن را در کنار آپشن -l استفاده کنید
# ستون پنجم را برای ما خواناتر می‌کند
    # ls -lh
        # حجم فایل‌ها بسیار خواناتر شده‌اند          
      # در این خروجی K به معنای کیلوبایت، M به معنای مگابایت و G به معنای گیگابایت          


# در صورت استفاده از دستور ls با آپشن a-، تمامی فایل‌ها نمایش داده می‌شود
# معمولا فایل‌ها و دایرکتوری‌هایی که با . شروع می‌شوند جزء فایل‌های مخفی سیستم به حساب می‌‌آیند و با ls به شما نمایش داده نمی‌شوند
    # ls -a  =>  .  ..  .linux  a.py  b.py  c.py


# دستور ls به صورت پیش‌فرض نتایج را به صورت الفبایی مرتب می‌کند
# در صورت استفاده از دستور ls با آپشن r-، نتایج برعکس می‌شوند
    # ls -r  =>  c.py  b.py  a.py
    
# آپشن R- به صورت بازگشتی (recursive) به تمامی دایرکتوری‌های درون دایرکتوری فعلی شما رفته 
# و محتویات درون هر یک را نیز به طور جداگانه‌ای نمایش می‌دهد
    # ls -R
        # .:
        # my_folder   a.py
        # ./my_folder:
        # a.txt   b.txt   c.txt


# امکان وارد کردن یک دستور با چند آپشن همزمان یا چند آپشن تلفیقی وجود داره
    # ls -l -t
    # ls -lt  =>  مشاهده نتایج به صورت دقیق و مرتب‌سازی شده بر اساس زمان آخرین تغییرات
    

# هرچی جلوی دستور ls میذاریم یک آرگومان یا یک آپشن هست
# یک آرگومان ثابت رو میشه به دستورهای مختلف داد و مشکلی هم پیش نمیاد
# مثلا آرگومان زیر وقتی به دستور cd میدیم دایرکتوری تغییر میکنه
# ولی وقتی به ls میدیم بدون تغییر دایرکتوری (از هر جایی که توش هستیم) میتونیم محتویات دارکتوری مقصد رو ببینیم
# cd ../new_folder/file
# ls ../new_folder/file -lth
    





'''   __________________
     |                 |
     |   Directory     |
     |_________________|
'''

# Making directory:
    # mkdir name
    
# Making more than one library at once:
    # mkdir name1 name2 name3

# Making directory from 1-5:
    # mkdir name(1..5)   =>   name1 name2 name3 name4 name5
    
# Making a directory while there is a space inbetweenn it's name:
    # mkdir "a example"
    # mkdir a\ example

# Making a new directory inside a new directory (-p option):
    # mkdir -p a/inside-a
    # mkdir -p a/inside-a/inside-inside-a
    


# rmdir (remove directory): => only works when directory is empty
    # rmdir name
    # when directory is not empty => failed to remove 'name': Directory not empty
    
    
# Deleting a not empty directory:
    # mkdir -p a/b/c/ (we want to delete c)
    
    # (1)
    # rmdir a/b/c/ 
    # rmdir a/b/
    # rmdir a/
    
    # (2)
    # rmdir a/b/c/ a/b/ a/
    
    # (3)  -p option
    # rmdir -p a/b/c/



# app
# ├── node_modules
# ├── public
# │   └── images
# │       └── 2022
# └── src

# mkdir -p app/node_modules app/src app/public/images/2022
# rm -rf app/  =>  remove all







'''   ____________________
     |                   |
     |   touch - cat     |
     |___________________|
'''


# Create a new file:
    # touch a.txt
    # touch a.txt b.txt c.txt
    # touch 'a example.txt' 'b example.txt' 'c example.txt'
    # touch a\ example.txt b\ example.txt c\ example.txt
    
# View a file:
    # cat sample.txt
        # hello
        #
        # this is a test
    
# -n option:
    # cat -n sample.txt  (line numbers)
        # 1 hello
        # 2
        # 3 this is a test

# -b option:
    # cat -b sample.txt   (ignores empty lines)
        # 1 hello
        # 2- this is a text

# Writing inside a file:
    # cat > sample.txt
        # entering new text => ctrl + d (save)






'''   _____________________
     |                    |
     |   cp - mv - rm     |
     |____________________|
'''

# cp (copy)

# از a.txt که در دایرکتوری فعلی‌مان وجود دارد در دایرکتوری test یک کپی به نام b.txt می‌سازد
    # cp a.txt test/b.txt
    
# از فایل a.txt در دایرکتوری test1 یک کپی به نام b.txt در دایرکتوری test2 می‌سازد
    # cp test1/a.txt test2/b.txt
    
# یک کپی از دایرکتوری dir1 به نام dir2 در دایرکتوری test می‌سازد
# کپی کردن کل دایرکتوری با محتوای داخلش
    # cp -r dir1/ test/dir2
    
# با این آپشن امکان مشاهده ریز به ریز جزئیات کپی شدن برای‌مان فراهم است
# این اطلاعات به ما نشان می‌دهد که دقیقا هر فایل از کدام مبدا، به کدام فایل در مقصد کپی شده است
    # cp -v a.txt b.txt


# mv (move) -> این دستورات برای فایل و دایرکتوری یکی هستن

# دستور زیر فایل file را از دایرکتوری dir1 را به دایرکتوری dir2 منتقل می‌کنند
    # mv dir1/file dir2/
    
# دستور زیر نام file1 را به file2 تغییر می‌دهد
    # mv file1 file2




# rm (remove) -> حذف فایلها و دایرکتوری

# دستور زیر فایل a.txt درون دایرکتوری test را حذف می‌کند
    # rm test/a.txt
    
# دستور زیر دایرکتوری test و همه فایل‌ها و دایرکتوری‌های داخلش را حذف می‌کند
    # rm -r test/








'''   _____________________
     |                    |
     |   date - time      |
     |____________________|
'''
# چگونه می‌توانیم تاریخ و زمان دقیق را در هر لحظه در ترمینال‌مان مشاهده کنیم


# date command
# برای نمایش تاریخ و زمان دقیق سیستم‌مان   
# همچنین می‌توانیم از این دستور برای تغییر و ست کردن زمان و تاریخ سیستم‌مان استفاده کنیم   
   # date  =>  Sun Oct  3(روز هفته) 09:44:29 +0330(time zone) 2021

   # -u option
   # نمایش تاریخ و زمان بصورت GMT(Greenwich Mean Time)/UTC(Coordinated Universal Time )   
   # date -u  => Sun Oct  3 06:23:49 UTC 2021

    # ما می‌توانیم خروجی این دستور را به کلی عوض کنیم   
    # مثلا بگوییم به جای Sun، به ما Sunday را نمایش دهد   
   # date "+%FORMAT"  => قالب کلی استفاده از فرمت ها
   
   
# FORMAT LIST

   # date "+%D"  => 10/03/25  mm/dd/yy
   # date "+%Y-%m-%d"  => 2025-10-03  yy-mm-dd
   # date "+%Y/%m/%d"  => 2025/10/03
   # date "+%A %B %d %T"  => Sunday October 03 13:47:38

   # %D
   # این فرمت تاریخ را به فرمت mm/dd/yy را نمایش می‌دهد      
   # %d
   # این فرمت روز ماه (که عددی بین 01 تا 31 است) را نمایش می‌دهد      
   # %a
   # این فرمت نام کوتاه روز هفته (یعنی از Sun تا Sat) را نمایش می‌دهد      
   # %A
   # این فرمت نام کامل روز هفته (یعنی از Sunday تا Saturday) را نمایش می‌دهد      
   # %h \ %b
   # این فرمت‌ها نام کوتاه ماه (یعنی از Jan تا Dec) را نمایش می‌دهند      
   # %B
   # این فرمت نام کامل ماه (یعنی از January تا December) را نمایش می‌دهد      
   # %m
   # این فرمت‌ عدد ماه (یعنی از 01 تا 12) را نمایش می‌دهد      
   # %y
   # این فرمت‌ دو رقم آخر سال (یعنی از 00 تا 99) را نمایش می‌دهد      
   # %Y
   # این فرمت‌ عدد 4 رقمی سال (یعنی مثلا 2021) را نمایش می‌دهد      
   # %T
   # این فرمت‌ ساعت را به فرمت 24 ساعتی (یعنی به فرمت HH:MM:SS) نمایش می‌دهد      
   # %H
   # این فرمت‌ فقط ساعت را نمایش می‌دهد      
   # %M
   # این فرمت‌ فقط دقیقه را نمایش می‌دهد     
   # %S
   # این فرمت‌ فقط ثانیه را نمایش می‌دهد     
   


# --date option
   # برای دیدن زمان‌های گذشته می‌توانیم از این آپشن استفاده کنیم   
   # فرض کنید می‌خواهیم 2 سال پیش همین موقع را بررسی کنیم   
   # date --date="2 year ago"  =>  Thu Oct  3 11:41:15 +0330 2023
   
   # یا اگر می‌خواستیم 5 ثانیه پیش را بررسی کنیم   
   # date --date="5 sec ago"  =>  Sun Oct  3 11:42:40 +0330 2025
   
   # یا اگر می‌خواستیم دیروز را بررسی کنیم   
   # date --date="yesterday"  =>  Sat Oct  2 11:45:33 +0330 2025
   
   # همچنین برای بررسی 2 ماه پیش   
   # date --date="2 month ago"  =>  Tue Aug  3 12:46:17 +0430 2025
   
   
   
# --set option
   # به کمک این آپشن می‌توانیم تاریخ و ساعت سیستم‌مان را تغییر دهیم   
   # توصیه می‌کنیم هرگز از این دستور استفاده نکنید   
   # مثلا اگر می‌خواستیم زمان و تاریخ سیستم‌مان را به زمان و تاریخ Tue Nov 13 15:23:34 PDT 2018 تغییر دهیم   
   # date --set="Tue Nov 13 15:23:34 PDT 2018"
   
   
   
# cal command
   # مشاهده تقویم داخل ترمینال   
   # این دستور برای مشاهده تقویم یک ماه موردنظر و یا یک سال موردنظرمان نیز کاربردی است   
   
   # cal => مشاهده ماه جاری بصورت کامل
   # cal -y => یک سال
   
   # cal -A 2
       # این آپشن به تعداد دلخواه‌مان ماه‌های بعد از ماه فعلی‌مان را نشان می‌دهد      
       # برای مثال فرض کنید می‌خواهیم دو ماه آینده را نیز ببینیم      
       
   # cal -B 2
   # این آپشن به تعداد دلخواه‌مان ماه‌های قبل از ماه فعلی‌مان را نشان می‌دهد      
   # برای مثال فرض کنید می‌خواهیم دو ماه قبلی را نیز ببینیم      
   
   # cal -B 2 -A 2
   # فرض کنید می‌خواستیم ماه فعلی‌مان را در کنار ۲ ماه پیش و پس از آن ببینیم      
   
   # cal 2002  =>  تقویم سالهای گذشته
   # cal 2060  =>  تقویم سالهای آینده
   # cal 02 2002  => مشاهده یک ماه خاص (ماه دوم) از سالهای گذشته یا آینده
   
   
   
   
   




'''   __________________________
     |                         |
     |   Standard streams      |
     |_________________________|
'''
# استریم‌ها یک راه برای برقراری ارتباط بین برنامه‌ها و سیستم‌عامل هستند که از طریق آنها اطلاعات رد و بدل می‌شود
# می‌توانیم استریم‌ها را مانند راه‌های ارتباطی در بدن انسان تصور کنیم: سرخرگ-سیاهرگ-اعصاب
# سیستم‌عامل ما هم از استریم‌ها برای انتقال اطلاعات استفاده می‌کند
#  استریم‌ها کانال‌هایی هستند که داده‌ها از طریق آن‌ها بین برنامه‌ها و سیستم جریان پیدا می‌کنند


# standard stream
    # به‌طور کلی در لینوکس به کانال‌های ارتباطی پراسس‌ها که همان ورودی و خروجی (I/O) است، استاندارد استریم گفته می‌شود
#  هنگامی که شما شروع به نوشتن دستورات در ترمینال‌ می‌کنید ورودی استاندارد از طریق کیبورد شما به ترمینال منتقل می‌شود
# همچنین خروجی استاندارد و ارور استاندارد از طریق ترمینال‌تان به‌صورت متن به شما نمایش داده می‌شود

#                                    ____________________
#                                    |     TERMINAL     |
#  __________________                |__________________|
#  | ___________    |                |    ____________  |
#  | |         | <-======= 0-stdin ====== | Keyboard |  |
#  | |         |    |                |    |__________|  |
#  | |         |    |                |     ___________  |
#  | | Process | ======= 1-stdout ======-> |         |  |
#  | |         |    |                |     | Monitor |  |
#  | |         | ======= 2- stderr =====-> |         |  |
#  | |_________|    |                |     |_________|  |        
#  |________________|                |__________________|
#
   

#  استاندارد استریم‌ها در محیط لینوکس به سه دسته زیر تقسیم شده‌اند:
    # 1- stdin = standard input
    # 2- stdout = standard output
    # 3- stderr = standard error
    

# همچنین به ترتیب زیر به هرکدام از این استاندارد استریم‌ها یک عدد اختصاص داده شده:
    # 0 = stdin
    # 1 = stdout
    # 2 = stderr
    

# Standard Input
   # ورودی استاندارد معمولا دیتا را از یوزر به برنامه منتقل می‌کند   
   # برنامه‌هایی که با گرفتن ورودی استاندارد کار می‌کنند، عموما ورودی خود را از یک دستگاه مانند کیبورد دریافت می‌کنند   
   # ورودی استاندارد هنگامی تمام می‌شود که به EOF (end-of-file) برسد   
   # اینجا EOF یعنی دیگر دیتایی برای خواندن وجود ندارد   
   
   # مثلا دستور cat وارد میکنیم   
   # حالا این دستور منتظره تا با کیبورد ورودی استاندارد را وارد کنیم   
   # دستوز Cat میاد ورودی مارو بصورت متن به صقحه ترمینال میفرسته   
   # a
   # b
   # c
  # حالا EOF می‌تواند توسط شما  با فشردن ctrl+d به دستور ورودی داده شود   
  
  
# Standard output
# خروجی استاندارد دیتایی که توسط برنامه ساخته شده‌است را برای‌مان می‌نویسد   
# به‌طور پیش‌فرض خروجی استاندارد، دیتا را به صورت متن در ترمینال می‌نویسد   
   # echo sent to the terminal through standard output   


# Standard error
   # ارور استاندارد، ارورهایی که توسط برنامه ساخته شده‌اند را برای ما می‌نویسد   
   # مانند خروجی استاندارد، مقصد پیش‌فرض این استاندارد استریم نیز صفحه ترمینال است   
   # ls ~/Desktop  =>  در هرکجای سیستم‌تان که باشید با اجرای این دستور محتویات دسکتاپ را مشاهده می‌کنید
   # ls %
   # ls: cannot access %: No such file or directory  => از آنجایی که % یک دایرکتوری نیست، این دستور، این متن را به استاندارد استریم ارور می‌فرستد
#  از آنجایی که مقصد پیش‌فرض این استاندارد استریم صفحه ترمینال است، این متن برای ما در ترمینال‌مان نمایش داده می‌شود   



#  ______________________________________
#  |                                    |
#  |  Redirection of standard streams   |
#  |____________________________________|

# redirection = ینی تغییر مسیر
# یعنی مسیر استریم هارو به هرجایی میخوایم هدایت کنیم     

# دستورات redirection می‌توانند برای نوشتن خروجی استاندارد یا خطای استاندارد به یک فایل استفاده شوند
# اگر به فایلی که وجود ندارد بنویسید، قبل از نوشتن، یک فایل جدید با آن نام ایجاد می‌شود


# دستوراتی که یک علامت کوچکتر یا بزرگتر دارن، محتوای موجود مقصد را بازنویسی (overwrite) می‌کنند
# < - خروجی استاندارد (با کد 1)   
# > - ورودی استاندارد (با کد 0)   
# <2 - خطای استاندارد ( با کد 2)   

# دستوراتی که دو علامت کوچکتر یا بزرگتر دارن، محتوای موجود مقصد را بازنویسی نمی‌کنند بلکه الطاق یا append میکنن
# << - خروجی استاندارد   
# >> - ورودی استاندارد   
# <<2 - خطای استاندارد   


#____________________________________
# Standard Output Redirection (>)   |
#___________________________________|
    # ساده‌ترین نوع ریدایرکشن، فرستادن خروجی یک دستور به یک فایل است   
    # در bash می‌توان با کاراکتر < این کار را انجام داد   
 
    # خروجی استاندارد دستور command را می‌خواهیم در فایل output بریزیم   
   # حالا هر چیزی که به عنوان خروجی دستور روی صفحه نشان داده می‌شد، این بار به طور کامل به فایل منتقل می‌شود   
   # دیگر چیزی روی صفحه ظاهر نمی‌شود (مگر آنکه دستور با خطا اجرا شود)   
   # کاراکتر ریدایرکشنِ < در صورت وجود داشتن فایل از قبل، آن را بازنویسی (overwrite) می‌کند   
   # command > output

    # echo "hello from here" > file.txt  => دیگه چیزی روی صفحه نمایش داده نمیشه. یک فایل جدید ساخته میشه
                                            # همچنین اگر file.txt از قبل وجود داشته باشه تمام محتویاتش پاک میشه و جایگزین میشه                                            
    # cat file.txt  => hello from here


    # حالا اگه نخوایم overwrite اتفاق بیوفته چی؟   
    # یعنی به جای بازنویسی فایل، با هر بار اجرای یک دستور، خروجی آن دستور صرفا به انتهای محتوای قبلی اضافه شود   
# برای این کار باید از >> استفاده کنیم   
   # command >> output
      # echo "hello" >> file-new.txt
      # echo "from" >> file-new.txt
      # date +%Y >> file-new.txt

   # cat file-new.txt
      # hello
      # from
      # 2025


#__________________________________
# Standard Input Redirection (<)  |
#_________________________________| 
   # این ریدایرکشن  به جای این که خروجی یک دستور را گرفته و به یک فایل بفرستد   
   # محتوای یک فایل را گرفته و به ورودی دستور می‌فرستد   
# در bash برای این نوع ریدایرکشن از کاراکتر > استفاده می‌کنیم   
   # محتویات فایل input را می‌خواهیم به عنوان ورودی به دستور command بدهیم:   
   # command < input

   # دستور Wc یک رشته یا فایل به عنوان ورودی گرفته و تعداد خطوط، کلمات و کاراکتر‌های آن را خروجی می‌دهد   
   #  در اینجا محتویات فایل file-new.txt را به عنوان یک رشته با کمک ریدایرکشن به دستور wc فرستادیم و خروجی مورد انتظارمان را نیز دریافت کردیم   
   # wc < file-new.txt  =>  4 4 22
   
   # اینجا هم کاراکتر >> داریم اما در اینجا مفهوم آن تفاوت دارد   
   # وقتی از >> استفاده می‌کنیم یعنی می‌خواهیم ورودی را خودمان وارد کنیم و نه از یک فایل!   
   # command << MARKER
   # data
   # MARKER

    #  دو علامت خاص به اسم MARKER قرار دادیم که کاربرد خاصی دارن و جزء متن ما نیستن   
    # داخل bash از این علامت‌های خاص برای فهمیدن شروع و پایان ورودی کاربر استفاده میشه   
# این MARKER هر رشته‌ای می‌تواند باشد تنها شرطی که دارد این است که هردو MARKER باید یکسان باشند   
   # wc << EOF
   # hello world
   # linux is gooood     3 6 32
   # bye
   # EOF
   
   


# نحوه نوشتن یک یا چند خط در یک فایل
   # تاحالا نوشتن یک خط یا کلمه در یک فایل راحت بود   
   # echo "helloooo" > hi.txt
   # خروجی دستور echo را به فایلی با نام hi.txt ریدایرکت میکنیم   
   
# حال فرض کنید ما بخواهیم محتوای زیر را در فایلی به اسم data.txt ذخیره کنیم:   
   # hello guys
   # linux is so powerful
   # goodbye

# می‌توانیم دوبار از ریدایرکشن استفاده کنیم و به هدف‌مان برسیم   
# در ابتدا متن را به دستور cat به عنوان ورودی ریدایرکت می‌کنیم   
# سپس خروجی را به فایلی با نام data.txt ریدایرکت می‌کنیم   

   # cat > data.txt <<EOF
   # "hello guys
   # linux is so powerful
   # goodbye"
   # EOF



#___________________________________
# Standard Error Redirection (2>)  |
#__________________________________|
    # در بسیاری از موارد، ما می‌خواهیم پیام‌های خطا را به جای نمایش در ترمینال، در یک فایل ذخیره کنیم   
    # این کار برای دیباگ کردن (debugging) یا ثبت خطاها (logging) در زمان اجرای مورد استفاده قرار خواهد گرفت   
    # برای این منظور، از تغییر مسیر (redirection) استفاده می‌کنیم   
   
# فرض کنید شما یک فرمانی دارید که ممکن است خطا تولید کند   
# برای مثال، در زیر سعی می‌کنیم فایلی به نام file.txt را بخوانیم، اما این فایل وجود ندارد   
   # cat file.txt
   # cat: file.txt: No such file or directory
   # این پیام خطا از طریق خطای استاندارد (stderr) نمایش داده می‌شود   
   # حالا اگر بخواهیم این پیام خطا به جای نمایش در ترمینال به یک فایل ارسال شود:   
      # cat file.txt 2> errors.log

# در این مثال، <2 خطای استاندارد را به فایل errors.log هدایت می‌کند   
# اگر فایل errors.log وجود نداشته باشد، به صورت خودکار ایجاد می‌شود   
# حالا وقتی فرمان اجرا شود، دیگر پیام خطا در ترمینال نمایش داده نمی‌شود، بلکه در فایل errors.log ذخیره می‌شود   
   # cat errors.log
   # cat: file.txt: No such file or directory
   
   
   # اضافه کردن خطاها به انتهای یک فایل:   
   # گاهی اوقات ممکن است بخواهید پیام‌های خطا را به فایل اضافه کنید، بدون اینکه محتوای قبلی فایل حذف شود   
   # برای این کار از عملگر <<2 استفاده می‌کنیم   
   # cat anotherfile.txt 2>> errors.log
   
   
   # dev/null
   # مثلا یه ارور داریم و میخوایم اگه اتفاق افتاد این ارور به ناکجاآباد redirect بشه   
   # یعنی میخوایم ارور سر به نیست بشه و بره یه جایی که اصلا نبینیمش   
   # در لینوکس این ناکجاآباد Dev/null هست و هرچیزی رو نیاز نداریم خروجی رو به device null میفرستیم   
   # این یه دایرکتوری نیست، بلکه یک دیوایس فایل ویژه است   
   # کارش اینه که هر ورودی‌ای رو که بهش میدیم، بلافاصله دور میریزه و کد خطای ۰ (عملیات موفقیت‌آمیز) گزارش میکنه   
   # cat a.txt 2>> dev/null
   
   
   
#__________________________________________
# Redirection of stdout & stderr at once  |
#_________________________________________|

# گاهی نیاز است که هم خروجی استاندارد و هم خطای استاندارد را به فایل‌های جداگانه هدایت کنیم   
# برای این کار می‌توانیم از عملگرهای < و <2 به طور همزمان استفاده کنیم   

   # ls /home /nonexistent 1> output.txt 2> errors.log
   # < خروجی استاندارد (stdout) را به فایل output.txt هدایت می‌کند      
# <2 خطای استاندارد (stderr) را به فایل errors.log هدایت می‌کند      

# اگر /home وجود داشته باشد و /nonexistent وجود نداشته باشد، محتوای output.txt شامل فهرست فایل‌های /home خواهد بود   
# و محتوای errors.log شامل پیام خطا برای /nonexistent خواهد بود   

   
   # روش خلاصه تر   
   # در این روش میایم میگیم هم stdout هم stderr بیاد redirect بشه به فلان فایل   
   # echo "bye" &>> a.txt
   





'''   ___________________
     |                  |
     |   Pipelines      |
     |__________________|
'''
# این هم یک نوع دیگه از redirection در لینوکس است
# این ریدایرکشن که Pipe نام دارد، خروجی استاندارد یک دستور را به ورودی استاندارد دستور دیگر ارسال می‌کند
#  یعنی ریدایرکشن بین دستور و دستور به جای دستور و فایل
#  بنابراین در لینوکس به جای آنکه دستورات بزرگ و همه فن حریف! داشته باشد
# به شما ریدایرکشن‌های مختلف به خصوص پایپ را داده است
# که بتوانید از ترکیب دستورات مختلف که هر کدام کار خاصی انجام می‌دهند، کارهای پیچیده‌تری انجام دهید

# کاراکتری که ریدایرکشن پایپ را انجام می‌دهد | است
# جهت حرکت داده نیز از چپ به راست است

# command1 | command2 | ... | commandn
# خروجی استاندارد دستور command1 به ورودی استاندارد command2 و ... ارسال میشود
#  در نهایت نیز خروجی دستور commandn در صفحه نمایش داده می‌شود چون در اینجا خروجی آن را به جایی ریدایرکت نکردیم


#   ______________________                  ________________________
#   |______PROCESS_______|                  |_______TERMINAL_______|
#   |    ____________    |                  |    _______________   |
#   |    |          | <-========stdin============|             |   |
#   |    | process1 |    |                  |    |  Keyboard   |   |
#   |    |__________|===========            |    |_____________|   |
#   |    stdout-stdin    |    ||            |                      |
#   |         ||         |   stderr         |                      |
#   |    ____________    |    ||            |    _______________   |
#   |    |          |    |    =================->|             |   |
#   |    | process2 |    |                  |    |             |   |
#   |    |__________|========stderr============->|   Monitor   |   |
#   |    stdout-stdin    |                  |    |             |   |
#   |         ||         |                  |    |             |   |
#   |    ____________    |                  |    |             |   |
#   |    |          |========stderr============->|             |   |
#   |    |process...|    |                  |    |             |   |
#   |    |__________|========stdout============->|             |   |
#   |                    |                  |    |_____________|   |
#   |____________________|                  |______________________|
#



# cat <<EOF | sort
# hello
# from
# alireza
# in quera
# to
# you
# EOF

# خروجی:
   # alireza
   # from
   # hello
   # in quera
   # to
   # you

# ابتدا به cat با کمک ریدایرکشن ورودی استاندارد، ورودی خود را می‌دهیم
# سپس خروجی آن را با کمک پایپ به ورودی استاندارد دستور sort می‌فرستیم
# دستور sort نیز ورودی خود را گرفته و آن را مرتب می‌کند و به عنوان خروجی در ترمینال چاپ می‌کند

#  شما می‌توانید خروجی یک دستور را به عنوان ورودی یک دستور دیگر نیز بکار ببرید
# برای مثال دستور whoami به شما نام کاربری‌تان را می‌گوید
# فرض کنید، شما قصد داشتید تا خروجی زیر را تولید کنید:
# My account name is <USERNAME>.

# برای این‌کار می‌توانیم از دستور زیر استفاده می‌کنیم:
# echo "My account name is $(whoami)."

# در خط بالا دستور whoami اجرا شده و نام کاربری شما به جای عبارت $(whoami) قرار می‌گیرد
# سپس دستور echo با ورودی نام کاربری شما اجرا می‌شود













'''   =======================================================================
      =======================================================================
      ====                                                               ====
      ====      Chapter 3       Working with file and string             ====
      ====                                                               ====
      =======================================================================
      =======================================================================
'''
#____________________________________________________________________________________________________________________
# در این فصل با نحوه مدیریت فایل‌ها و کار با رشته‌ها در لینوکس و برخی از دستورات مقدماتی آن‌ها آشنا خواهیم شد

# آشنایی با دستورات file و du برای نمایش جزئیات و اطلاعات فایل‌ها در لینوکس                 
# آشنایی با ادیتورهای پیش‌فرض لینوکس                                                         
# معرفی دایرکتوری‌های مهم لینوکس و آشنایی با ساختار فایل‌بندی لینوکس                        
# آشنایی با دستورات more، less، head و tail برای مشاهده راحت‌تر محتویات فایل‌ها در لینوکس   
# آشنایی با دستور cut برای حذف بخشی از محتویات فایل‌                                         
# آشنایی با دستورات sort و wc و کاربرد آن‌ها                                                  
# آشنایی با دستور grep در لینوکس                                                              
# آشنایی با دستور find برای جستجوی فایل‌ها در ترمینال و آپشن‌ها مختلف آن                     
# معرفی وایلدکاردها (Wildcards) در لینوکس و کاربرد آن‌ها                                      
# آموزش روش‌های مختلف فشرده‌سازی فایل‌ها در لینوکس                                              
# آشنایی با دستور awk در لینوکس                                                               
#____________________________________________________________________________________________________________________



'''   ___________
     |          |
     |   du     |
     |__________|
'''
# Disk Usage
# این دستور به ما این امکان را می‌دهد تا بتوانیم میزان حافظه مصرفی را ببینیم

 
 
# Random
# ├── Elasticsearch.ipynb
# ├── ExcelTemplating
# │   ├── excel.ipynb
# │   ├── hunter_biography.PNG
# │   ├── hunter.ini
# │   ├── hunter.json
# │   ├── hunter.py
# │   ├── HunterxHunter.xlsx
# │   └── README.md
# ├── newsapp
# │   ├── newsapp
# │   │   ├── __init__.py
# │   │   ├── resources
# │   │   │   ├── thestar2_travel_tag.csv
# │   │   │   └── Travel Articles.ipynb
# │   │   ├── static
# │   │   │   ├── content.css
# │   │   │   └── newslist.css
# │   │   ├── templates
# │   │   │   ├── article.html
# │   │   │   └── newslist.html
# │   │   └── views.py
# │   ├── output.gif
# │   ├── README.md
# │   └── run.py
# ├── Pipeline Test.ipynb
# ├── README.md
# ├── Requests and Geocoder.ipynb
# ├── Selenium.ipynb
# ├── Setups
# │   ├── dremio_setup.sh
# │   └── HDFS3.ipynb
# └── Utility
#    ├── Argparse & yaml reader.ipynb
#    └── pyMySQL & Psycopg2.ipynb


# اگر در دایرکتوری بالا دستور du رو بزنیم:

# ---------------------------------------------------------
# | Directory Disk Usage |    Directory Adress            |
# ---------------------------------------------------------
# |      12              |    ./newsapp/newsapp/templates |
# |      9052            |    ./newsapp/newsapp/resources |
# |      12              |    ./newsapp/newsapp/static    |
# |      9088            |    ./newsapp/newsapp           |
# |      15452           |    ./newsapp                   |
# |      852             |    ./ExcelTemplating           |
# |      16              |    ./Utility                   |
# |      112             |    ./Setups                    |
# |      19316           |    .                           |
# ---------------------------------------------------------



''' -h , --human-readable   '''
    # این آپشن خروجی دستور du را برای‌ما خواناتر می‌کند    
    # خروجی از اعداد 4 و 2896 به اعداد 4K و 2.9M و ... تبدیل می‌شود    


''' -s , --summarize   '''
# این آپشن خروجی دستور du را برای‌ما خلاصه‌تر می‌کند    
# با کمک این آپشن تنها میزان حافظه مصرفی دایرکتوری فعلی‌مان را می‌بینیم    
# یعنی برعکس حالت قبلی، نمیتونیم حافظه مصرفی همه‌ی دایرکتوری هارو ببینیم    
# از این آپشن در کنار آپشن -h استفاده می‌شود    
    # du -sh  =>  19M .


''' -c, --total   '''
# یک خط در انتهای خروجی چاپ می‌کند و مجموع حافظه مصرفی کل دایرکتوری را به عنوان total به ما نمایش می‌دهد    
    # -> du -ch
    # 12K     ./newsapp/newsapp/templates
    # 8.9M    ./newsapp/newsapp/resources
    # 12K     ./newsapp/newsapp/static
    # 8.9M    ./newsapp/newsapp
    # 16M     ./newsapp
    # 852K    ./ExcelTemplating
    # 16K     ./Utility
    # 112K    ./Setups
    # 19M     .
    #[19M     total]


''' --time   '''
# علاوه بر میزان حافظه مصرفی، تاریخ آخرین دسترسی ما به فایل یا دایرکتوری را نیز نمایش می‌دهد    
    # -> du -h --time
    # 12K     2021-09-02 12:26    ./newsapp/newsapp/templates
    # 8.9M    2021-09-02 12:26    ./newsapp/newsapp/resources
    # 12K     2021-09-02 12:26    ./newsapp/newsapp/static
    # 8.9M    2021-09-02 12:26    ./newsapp/newsapp
    # 16M     2021-09-02 12:26    ./newsapp
    # 852K    2021-09-02 12:26    ./ExcelTemplating
    # 16K     2021-09-02 12:26    ./Utility
    # 112K    2021-09-02 12:26    ./Setups
    # 19M     2021-09-06 12:11    .







'''   ___________
     |          |
     |   du     |
     |__________|
'''
# این دستور برای نشان دادن تایپ فایل مورد نظر ما استفاده می‌شود
# این تایپ به دو صورت به شما نمایش داده می‌شود:
# 1- یا به صورت human-readable که برای ما با معناتر است (مانند ASCII text)    
# 2- یا به صورت MIME که برای ما معنای کمتری دارد (مانند text/plain; charset=us-ascii)    

# برای مثال اگر در ترمینالی درون دایرکتوری Random دستور زیر را اجرا کنید:
''' file README.md  ''' 
    # README.md: ASCII text  -->  بیان می‌کند این فایل، یک فایل متنی‌ست

''' file ExcelTemplating/hunter_biography.PNG  '''
    # ExcelTemplating/hunter_biography.PNG: PNG image data, 606 x 799, 8-bit/color RGBA, non-interlaced 
    # این خروجی نشان می‌دهد که این فایل از نوع عکس است و جزئیاتی مثل ابعاد تصویر، وضوح رنگی تصویر و ... را نمایش می‌دهد    


''' -b  '''
# گاهی اوقات نیاز به اطلاعات با جزئیات ریز نداریم و تنها می‌خواهیم نوع فایل را ببینیم    
    # file -b README.md   =>  ASCII text
    
    




'''   _________________________
     |                        |
     |   Terminal editors     |
     |________________________|
'''

# ==============
'''   Nano   '''
# ==============

# sudo apt install nano
# terminal => nano

# اگر قصد داریم فایل خاصی را با آن ویرایش کنیم، باید مسیر و نام فایل را در ادامه دستور وارد کنیم:
    # nano /home/younesious/Documents/example.txt
    

# Ctrl+W
# جست و جوی یک کلمه خاص در متن (مثلا کلمه linux)    
# نانو هر کلمه‌ای که شامل linux باشد را پیدا می‌کند    
# ما با فشردن Alt+W می‌توانیم به واژه بعدی که شامل linux است برویم    
# با Alt+Q نانو ما را به linux قبلی هدایت می‌کند    


# Ctrl+\
    # مثلا میخوایم کلمه linux با کلمه ubunto جایگزین کنیم    
    # بعد از زدن میانبر ابتدا کلمه ubunto را تایپ میکنیم    
    # حالا اگه Y بزنیم فقط کلمه linux فعلی با ubunto جایگزین میشه    
    # اگر A بزنیم همه‌ی linux های متن با ubunto جایگزین میشن    
    
    
# انتخاب و کپی کردن متن
    # ابتدا با حرکت دادن cursor به ابتدای جمله، آن را با استفاده از Ctrl+6 در حالت انتخاب قرار می‌دهیم    
    # سپس با حرکت دادن مکان‌نما تا هر جایی که قصد کپی کردن آن را داریم، متن را انتخاب می‌کنیم    
    # با زدن Alt+6 متن انتخاب‌ شده در بافرِ کپی، ذخیره می‌شود    
    # حال اگر بخواهیم این جمله را در انتهای متن paste کنیم، با حرکت دادن مکان‌نما به انتهای متن و استفاده از دستور Ctrl+U، جمله کپی شده در آن موقعیت الصاق می‌شود    


# text justify
# برای جاستیفای کردن یک خط از متن، ابتدا مکان‌نما را به آن خط می‌بریم    
# سپس با استفاده از دستور Ctrl+J، آن خط را جاستیفای می‌کنیم    


# Alt+U
    # آخرین تغییرات رو undo میکنه    


# Ctrl+X
#  برای ذخیره تغییرات و خروج از نانو    
# با انتخاب Y ، می‌توانیم نام فایل را تغییر دهیم    
# با فشردن Enter بدون تغییر نام فایل، تغییرات را ذخیره کرده و از ادیتور خارج میشویم    


# Ctrl+G
# ورود به صفحه Help نانو و مشاهده همه میانبرها    
# با q از این صفحه خارج میشه    







'''   __________________________
     |                         |
     |   Linux Directories     |
     |_________________________|
'''
# در این قسمت دایرکتوری های اصلی لینوکس توضیح داده شده


''' /  '''
# این دایرکتوری (که در آدرس / قرار دارد و می‌توانید با دستور cd / به آن ورود کنید) به دایرکتوری root شهرت دارد    
# این بالاترین دایرکتوری ممکن در ساختار فایلی لینوکس است و تمامی فایل‌ها و سایر دایرکتوری‌های کل سیستم‌عامل‌تان درون این دایرکتوری قرار دارند    


''' /root  '''
    # cd /root
    # این دایرکتوری، دایرکتوری خانه کاربر root (و یا سوپریوزر کامپیوتر) شماست    


''' /bin  '''
# این دایرکتوری در آدرس /bin قرار دارد و می‌توانید با دستور cd /bin به آن ورود کنید    
# در این دایرکتوری فایل‌های اجرایی (فایل‌های باینری) دستورات مهم لینوکس قرار گرفته است    
# به‌طوری که، هر زمانی قصد استفاده از دستورات اساسی لینوکس را داشته باشیم، این فایل‌ها به اجرا در می‌آیند    

    # which command
    # اگر بخواهیم فایل اجرایی هر دستوری را پیدا کنیم، می‌توانیم از دستور which استفاده کنیم        
    # این دستور نام دستوری دیگر را از ما ورودی می‌گیرد        
    # و در خروجی به ما دایرکتوری‌ای که فایل‌های اجرایی آن دستور درون آن قرار دارد را نمایش می‌دهد        
        # which du  => /usr/bin/du
        

''' /sbin  '''
    # cd /sbin
    # این دایرکتوری مشابه دایرکتوری /bin است    
    # در آن فایل دستوراتی که فقط مدیر سیستم می‌تواند با آن‌ها کار کند، قرار دارند    


''' /lib  '''
    # cd /lib
# درون این دایرکتوری  کتابخانه‌های موردنیاز برای دایرکتوری‌های /bin و /sbin وجود دارد    


''' /boot   '''
    # cd /boot
    # درون این داریکتوری فایل‌های هسته لینوکس و کانفیگ‌های سیستم‌عامل که برای بوت سیستم لازم است، قرار دارد    
    
    
''' /dev  '''
    # cd /dev
# درون این دایرکتوری  فایل‌های دیوایس‌هایمان (مانند ورودی/خروجی و ...) قرار دارند    
# خروجی مهم /dev/null در این دایرکتوری قرار دارد    


''' /etc  '''
    # cd /etc
    # درون این دایرکتوری  فایل‌های کانفیگ مهم سیستم‌عامل قرار دارد    
    # عمدتا برای تغییر این کانفیگ‌ها نیاز به دسترسی root داریم    


''' /home  '''
    # cd /home
    # درون این دایرکتوری، دایرکتوری خانه (home directory) کاربران سیستم قرار دارد    
    # فرض کنید یوزر شما در سیستم salib باشد. دایرکتوری خانه شما /home/salib خواهد بود    
    # به طور کلی آدرس دایرکتوری خانه هر حساب برابر با /home/USERNAME خواهد بود    


''' /media  '''
    # cd /media
    # درون این دایرکتوری معمولا محتویات دیوایس‌های خارجی از قبیل CD و DVD و ... قرار می‌گیرند    
    # برای مثال وقتی شما CD‌ای را درون سیستم شخصی‌تان قرار می‌دهید    
    # اگر بخواهید به فایل‌های آن دسترسی داشته باشید باید به درون این دایرکتوری بروید و دنبال آن‌ها بگردید    


''' /mnt  '''
    # cd /mnt
    # درون این دایرکتوری معمولا محتویات موقتی دیوایس‌های خارجی از قبیل USB و یا هارد اکسترنال و ... قرار می‌گیرند    
    # برای مثال وقتی شما USB‌ای را درون سیستم شخصی‌تان قرار می‌دهید    
    # اگر بخواهید به فایل‌های آن دسترسی داشته باشید باید به درون این دایرکتوری بروید و دنبال آن‌ها بگردید    


''' /opt  '''
    # cd /opt
    # این دایرکتوری توسط نرم‌افزار‌هایی که برروی لینوکس نصب می‌کنید، مورد استفاده قرار می‌گیرد    
    
    
''' /proc  '''
    # cd /proc
    # درون این دایکتوری برخی اطلاعات مربوط به ریسورس‌ها و منابع سیستم قرار دارد    
    
    
''' /tmp  '''
    # cd /tmp
    # در این دایرکتوری فایل‌های موقت مورد نیاز برنامه‌ها و یا سیستم‌عامل‌تان قرار دارند    
    # به‌طور کلی، برنامه‌ها برای ذخیره بعضی از داده‌هایشان به‌صورت موقت از این دایرکتوری استفاده می‌کنند    
    # این دایرکتوری یک ویژٰگی منحصر به فرد دارد و آن این است که با هربار ری‌استارت کردن و یا خاموش و روشن کردن دستگاه‌تان، محتویات آن پاک می‌شود    
    # یعنی اگر در لحظه‌ای نیاز به ایجاد یک فایل خاص و یا نگهداری یک دیتا‌ موقت داشتید، می‌توانید فایل‌هایتان را درون این دایرکتوری قرار دهید    


''' /usr  '''
    # cd /usr
    # درون این دایرکتوری اطلاعاتی مربوط به هرکاربر قرار دارد که پس از نصب تغییری نمی‌کنند    


''' /var  '''
    # cd /var
    # درون این دایرکتوری داده‌های متغیر که می‌توانند توسط بسیاری از اپلیکیشن‌ها استفاده شوند، قرار دارد    













