
'''
===============================================================================
===============================================================================
================       Created on Fri Jul 17 12:54:31 2026     ================
================                IDE: Spyder                    ================
================         Author: Khashayar Alipour             ================
================                 ML Concepts                   ================
===============================================================================
===============================================================================
'''

# در این فایل مفاهیم و اصطلاحات مهم مبحث ماشین لرنینگ توضیح داده شده اند



# AI
# │
# └── Machine Learning
#     │
#     ├── Classical Machine Learning
#     │   │
#     │   ├── Supervised Learning              |── LinearRegression
#     │   │   │                                ├── Ridge
#     │   │   ├── Regression                   ├── Lasso
#     │   │   │   │                            ├── ElasticNet
#     │   │   │   ├── Linear Regression ───────└── SGDRegressor
#     │   │   │   └── Nonlinear Regression _____
#     │   │   │                                ├── Polynomial Regression
#     │   │   │                                ├── Decision Tree
#     │   │   │                                ├── Random Forest
#     │   │   │                                ├── SVR
#     │   │   │                                ├── KNN Regressor
#     │   │   │                                └── Gaussian Process
#     │   │   └── Classification ___  
#     │   │                        ├── Binary Classification
#     │   │                        ├── Multi-Class Classification
#     │   │                        ├── Multi-Label Classification
#     │   │                        ├── Ordinal Classification
#     │   │                        └── Models
#     │   │                               ├── Logistic Regression
#     │   │                               ├── SGDClassifier
#     │   │                               ├── Decision Tree
#     │   │                               ├── Random Forest
#     │   │                               └── ...
#     │   ├── Unsupervised Learning
#     │   │   ├── Clustering
#     │   │   ├── Dimensionality Reduction
#     │   │   └── Association Rules
#     │   │
#     │   ├── Semi-Supervised Learning
#     │   │
#     │   └── Reinforcement Learning
#     │
#     └── Deep Learning ________ 
#                              ├── MLP (Regression / Classification)
#                              ├── CNN
#                              ├── RNN
#                              ├── LSTM
#                              ├── GRU
#                              ├── Transformer
#                              ├── AutoEncoder
#                              └── GAN



        

# مدل های ماشین لرنینگ از نظر معماری ساخت، به دو گروه تقسیم میشن:
# Deep Learning و Classical Machine Learning

# مدل‌ها از نظر نوع یادگیری به چند گروه تقسیم میشن:
# Supervised، Unsupervised، Semi-Supervised و Reinforcement




#==========================
''' supervised learning '''
#==========================
# حالتی از یادگیری ماشین که هم ورودی و هم خروجی (label) رو میدیم با ماشین تا الگوهارو یاد بگیره

# براساس نوع خروجی 2 گروه میشه:
# 1-supervised regression --> خروجی بصورت پیوسته (عددی) میباشد
# 2-unsupervised classification --> خروجی بصورت دسته بندی و ناپیوسته هست



#============================
''' Unsupervised learning '''
#============================
# در دسته بندی supervised ما در ورودی یک input(x,y) داشتیم
# اینو وقتی میدادیم به مدل، هم x داشت و هم y داشت
# حالا مدل میرفت رابطه بین x و y رو پیدا میکرد
# حالا اگه y نداشته باشیم چی میشه؟

# یه چیزی داریم به اسم clustering یا خوشه کردن
# مثلا کلی عکس از سگ و گربه داریم که میدیم به یک مدل و میگیم دسته بندی کن
# یعنی ورودی x رو داریم. ولی عکسها هیچکدوم label ندارن پس y نداریم
# با اینحال مدل میاد بر اساس ویژگی های تصاویر مثل رنگ و پیکسل و ... خودش دسته بندی میکنه
# میاد میگه اینا 2 گروه هستن ولی نمیدونه یک گروه سگ هست یه گروه گربه. به این نوع دسته بندی میگن cluster کردن
# به این میگن unsupervised classification که بدون y اینکار رو انجام داد




#====================
''' Deep learning '''
#====================

# حالا اگه تعداد دیتا خیلی خیلی زیاد باشه حالتهای supervised و unsupervised جوابگو نیستن
# باید بریم سراغ الگوریتمهای پیشرفته تر که عمیق تر هستن و لایه‌ها و پارامترهای بیشتری دارن

# در ماشین لرنینگ معمولی ممکن است خودت ویژگی‌ها (Features) را استخراج کنی
# مثلا برای تشخیص گربه‌ها بگی چهارپا یا دم و ...
# ولی در DL فقط عکس رو میدی و خودش ویژگی هارو متوجه میشه

# چرا بهش میگن deep؟ چون تعداد زیادی لایه (layer) برای تشخیص داره
# برای همین بهش Deep Neural Network هم میگن




#=============================
''' Reinforcement learning '''
#=============================

# در تمام مدلهای بالا دیتای ما آماده بود و میدادیم به مدل و آنالیز میکرد
# حالا ما میخوایم مدل خودش بره توی محیط و بصورت پیوسته دیتا بگیره و آموزش ببینه
# یادگیری در این نوع، با پاداش و جزا انجام میشه و درواقع یادگیری از روی تجربه انجام میشه




#=================
''' Regression '''
#=================
# رگرسیون یعنی پیش‌بینی یک مقدار عددی
# درواقع رابطه بین دو چیز رو پیدا میکنه
# هر وقت خروجی مدل یک عدد باشد، داریم مسئله رگرسیون حل می‌کنیم
# رگرسیون میتونه خطی باشه یا غیر خطی




#========================
''' linear regression '''
#========================
# رگرسیون خطی یعنی فرض می‌کنیم رابطه بین ورودی و خروجی یک خط مستقیم است
# y=ax+b
# در این قسمت، باید از مدل های خطی برای پیدا کردن رابطه خط استفاده کنیم
# Lasso
# ElasticNet
# Ridge
# LinearRegressor
# SGDRegressor



#=======================
''' LinearRegression '''
#=======================
# این اسم یک مدل در scikit-learn است
# کارش پیدا کردن رابطه خطی بین دو چیز هست
# y=ax+b
# با یک روش ریاضی مستقیم بنام Least Squares برای پیدا کردن این رابطه استفاده میکنه
# یعنی اصلاً Gradient Descent استفاده نمی‌کند



#=============
''' Ridge '''
#=============
# اینم یک مدل رگراسیون خطی در scikit-learn است
# یعنی اینم میخواد رابطه خط رو پیدا کنه
# مدل Ridge همان LinearRegression است، فقط قابلیت های اضافه دارد




#===================
''' SGDRegressor '''
#===================
# باز هم همان رگرسیون خطی است یعنی باز هم می‌خواهد رابطه خط رو پیدا کند
# برعکس مدل LinearRegressor که ضرایب خط رو از روش مستقیم پیدا میکنه،
# این مدل از الگوریتم gradient descent استفاده میکنه





#=====================
''' loss function '''
#=====================
# مثلا ما یک مدل میسازیم، یک پیشبینی میکنه و این پیشبینی اشتباهه
# چقدر اشتباه کرده؟ باید این اشتباه را اندازه بگیریم

# به این مقدار اشتباه می‌گیم loss یا خطا
# و فرمولی که این خطا را حساب می‌کنه بهش میگیم Loss Function

# هر مدلی loss کمتری داشته باشه پیشبینی بهتری میکنه و مدل بهتریه
# گرادیان نزولی الگوریتمی برای محاسبه کمترین مقدار loss است




#====================================
''' MSE - RMSE - huber loss - MAE '''
#====================================

# اینا همشون معروف ترین loss function ها برای محاسبه loss در Regression هستن

# Mean Squared Error (MSE) --> most famous loss for regression
# Root Mean Squared Error (RMSE)
# Mean Absolute Error (MAE)





#============================
''' loss - learning rate '''
#============================
from sklearn.linear_model import SGDRegressor
model = SGDRegressor(loss = 'squared_error',learning_rate='constant',eta0=0.0001 , max_iter=10000,random_state=42)

# پارامتر loss مشخص میکنه خطا به چه صورت محاسبه بشه
# این loss=squared_error یعنی خطا رو با روش MSE محاسبه کن

# همچنین learning rate میشه ریتمی که باهاش کم کم برای پیدا کردن ضریب ها پیش میره




#===========================
''' nonlinear regression '''
#===========================
# گاهی رابطه بین دو چیز اصلاً خط نیست و نمودار خطی دیگه جوابگو نیست
# در این زمینه باید از مدلهای غیر خطی استفاده کنیم
# Polynomial Regression
# Decision Tree
# Random Forest
# SVR




#============
''' Model '''
#============
# مدل چیزیه که مشخص میکنه شکل رابطه بین دو چیز به چه صورت هست
# انواع مدل خطی و غیر خطی داریم که انواع روابط رو پیدا میکنن
# خط
# سهمی
# منحنی نمایی
# سینوسی

# اول مدل با الگوریتم آموزش، Train میشه
# سپس هر مدل ضرایبی داره که باید پیدا بشه
# برای پیدا کردن این ضرایب از الگوریتم های بهینه سازی استفاده میشه




#=======================
''' Train Algorithms '''
#=======================
# وقتی میگیم model.fit یعنی مدل شروع به یاد گرفتن میکند
# به کل فرایند یاد گرفتن مدل میگن Training algorithm

# در رگراسیون خطی الگوریتمهای یادگیری عبارتند از:
    # 1-LinearRegression
    # 2-Batch GradientDescent
    # 3-Stochastic Gradient Descent
    # 4-Mini-Batch Gradient Descent
    # 5-Coordinate Descent
    # 6-LBFGS

# فرایند یادگیری یک مدل:
# data -> Model -> loss calculation -> Optimization alg -> trained model



#==============================
''' Optimization Algorithms '''
#==============================

# Optimization Algorithms
#          ├── Normal Equation
#          ├── Batch Gradient Descent
#          ├── Stochastic Gradient Descent
#          ├── Mini-Batch Gradient Descent
#          ├── Coordinate Descent
#          └── LBFGS

# الگوریتم یادگیری یک مفهوم کلی هست که الگوریتم بهینه سازی یه مرحله ازش هست
# وظیفه این الگوریتمها اینه که پارامترهای مدل را طوری تنظیم میکنه که خطا کمترین مقدار ممکن بشه

# خطا زیاده؟ -> کمی شیب را تغییر بده -> دوباره خطارو حساب کن -> بازهم تغییر بده -> تا به بهترین جواب برسی





#==============================================
''' Scaling - StandardScaler / MinMaxScaler '''
#==============================================

# به آوردن دیتاهای خیلی پراکنده که اختلاف زیادی باهم دارن، داخل یک طیف مشخص، میگن Scale کردن
# بعد از Scale کردن همه دیتاها تقریبا در یک محدوده قرار میگیرن

# عمل scale کردن بوسیله دو روش StandardScaler و MinMaxScaler انجام میشه






#=====================
''' Classification '''
#=====================

# نقطه مقابل رگراسیون میشه classification
# اونجا دنبال رابطه عددی بین دو چیز بودیم
# ولی اینجا دنبال دسته بندی چیزها هستیم




#=========================
''' LogisticRegression '''
#=========================

# این یک مدل هست برای محاسبه روابط در classification




#==================================
''' Statistical models validity '''
#==================================

# به مجموعه روشهایی برای سنجش اعتبار درست بودن یک مدل میگن validity یا اعتبار سنجی



#====================================
''' regression validation methods '''
#====================================

# این متودها بهمون کمک میکنن بفهمیم روی کدام داده‌ها مدل را ارزیابی کنم؟
# روشهایی هستند که هرکدوم با فرمول خاص خودشون دیتاهارو به دو گروه Train و test تقسیم میکنن
# Validation Methods
#     ├── Train/Test Split
#     ├── K-Fold Cross Validation
#     ├── Leave-One-Out
#     └── Stratified K-Fold
    
    
    

#====================================
''' regression evaluation metrics '''
#====================================

# این معیارها بهمون کمک میکنن بفهمیم عملکرد مدل را با چه معیاری اندازه بگیرم؟
# بعد ازینکه با متودهای validation تقسیم داده ها انجام شد، با معیارهای Evaluation میایم از عملکرد مدل test میگیریم
# Regression Metrics
#     ├── MAE
#     ├── MSE
#     ├── RMSE
#     ├── R² Score
#     └── Adjusted R²




#=========================
''' train_test_split() '''
#=========================

# یک روش برای سنجش Validity یک مدل هست
# که توش میایم از بین دیتاهایی که در دسترسی داریم بعضیاشو برای train استفاده میکنیم
# و بعضیاشو برای test نگه میداریم تا مدل اعتبار سنجی بشه




















































