

'''
        ====================================================================
        ===========      Created on Sun Jun 14 17:46:21 2026     ===========
        ===========         Author: Khashayar Alipour            ===========
        ===========        Pandas 2 - pre processing file        ===========
        ====================================================================
'''

        #=============================================
# بعد از فایل pandas.py این فایل بررسی شود |        
        #=============================================


# مسیر ML بطور کلی به اینصورته:
    # Data analysis, Data cleaning , Feature engineering --> ML WORKFLOW






#==============================================================================

# ما داخل دسکتاپ یک فایل اکسل داریم بنام data_15khordad.xlsx که توش دیتاهای ما قرار دارن
# میخوایم دیتاهای این فایل رو وارد spyder کنیم و روش عملیات انجام بدیم

'''
       data_15khordad.xlsx

   dama feshar  estehkam
0  40.0     '1'     400.0
1  50.0     '2'     500.0
2  60.0     '3'     600.0
3  70.0     '4'     700.0
4  80.0     '5'     NaN
5  90.0     '6'     900.0
6  100.0    '7'     1000.0
7  120.0    '8'     1100.0
8  NaN      '9'     1200.0
9  160.0    '10'    1300.0
10 100.0    '7'     1000.0
'''


#==============================================================================

# import data

import pandas as pd
data = pd.read_excel('/Users/apm/Desktop/data_15khordad.xlsx')

#==============================================================================

# معمولا حجم دیتا خیلی زیاده برای همین برای دیدن قسمتی از دیتامون از دستور head یا tail استفاده میکنیم



data.head()   # این دستور 5 ردیف اول رو برامون میاره
'''
   dama feshar  estehkam
0  40.0     '1'     400.0
1  50.0     '2'     500.0
2  60.0     '3'     600.0
3  70.0     '4'     700.0
4  80.0     '5'       NaN
'''

data.head(6)    # اگه تعداد ردیف بیشتری میخوایم باید عددش رو بهش بدیم
'''
   dama feshar  estehkam
0  40.0     '1'     400.0
1  50.0     '2'     500.0
2  60.0     '3'     600.0
3  70.0     '4'     700.0
4  80.0     '5'       NaN
5  90.0     '6'     900.0
'''
#==============================================================================



data.tail()     # مشاهده 5 ردیف آخر
'''
     dama feshar  estehkam
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
8     NaN     '9'    1200.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''

data.tail(6)     # مشاهده بیشتر از 5 ردیف آخر
'''
     dama feshar  estehkam
5    90.0     '6'     900.0
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
8     NaN     '9'    1200.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''
#==============================================================================


# متد info
# این متد اطلاعات خیلی مهمی از دیتای ما بهمون میده

# اینجا گفته که تایپ ایت دیتا DataFrame هست
# 11 تا ردیف داره که 0 تا 10 عدد ایندکس دارن
# 3 تا ستون داره
# اسم ستون هارو گفته، گفته هر ستون چندتا non-null داره و تایپ هر ستون گفته

data.info()
'''
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype  
---  ------    --------------  -----  
 0   dama      10 non-null     float64
 1   feshar    11 non-null     object 
 2   estehkam  10 non-null     float64
dtypes: float64(2), object(1)
memory usage: 392.0+ bytes
'''
#==============================================================================



# متد describe
# میاد در ستون ها دیتاهایی که اعداد پیوسته هستند رو از نظر آماری توصیف میکنه

data.describe()
'''
             dama    estehkam
count   10.000000    10.00000
mean    87.000000   870.00000
std     35.605867   305.68684
min     40.000000   400.00000
25%     62.500000   625.00000
50%     85.000000   950.00000
75%    100.000000  1075.00000
max    160.000000  1300.00000
'''

# حتی اگه بخوایم میشه فقط یک ستون رو توصیف کرد:

data['dama'].describe()
'''
count     10.000000
mean      87.000000
std       35.605867
min       40.000000
25%       62.500000
50%       85.000000
75%      100.000000
max      160.000000
Name: dama, dtype: float64
'''
#==============================================================================


# value_count()
# برای دیتاهای گسسته میشه از متد value_count() برای شمارش تعداد و ... استفاده کرد
# مثلا برای ستون جنسیت (مثلا مرد مرد زن مرد زن زن مرد ...)
# میخوایم ببینیم چندتا زن داریم

data.value_count()
#==============================================================================


# عملیات های آماری

data['dama'].max() #160.0
data['dama'].min()
data['dama'].mean()   # average
data['dama'].sum()   # total sum = 870.0
data['dama'].count()
data['dama'].median() 
data['dama'].std()     # standard eviation
#==============================================================================






'''      ==================================
         ====    ___________________   ====
         ====   |   Data Cleaning  |   ====
         ====   -------------------    ====
         ==================================
'''

# در کل دیتا ممکنه 4 تا مشکل داشته باشه که باعث بشه بگیم این دیتا clean نیست:
    # 1-Empty celll
    # 2-Wrong format
    # 3-Logical
    # 4-Duplicated



#==========================
'''  1- Empty cell  '''
#==========================

# خطای انسانی یا کامپیوتری و نرم‌افزاری میتونه باعث بشه یک خونه از دیتای ما خالی بمونه
# مثلا یک خونه NaN هست و عددی توش نیست
# ازونجایی که ML فقط عدد میفهمه، اگه به NaN بخوره کلا ارور میده


# اولین کار اینه که تشخصی بدیم کجا و چنتا empty cell داریم


#------------ یک راهش استفاده از info هست ----------
data.info()
'''
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column    Non-Null Count  
---  ------    --------------
 0   dama      10 non-null
 1   feshar    11 non-null 
 2   estehkam  10 non-null
'''    

# الان طبق این اطلاعاتی که بدست آوردیم، 3 تا ستون داریم که هر ستون 11 تا ردیف داره
# برای ستون 'dama' زده 10 تا non-null داریم پس باید یکیش null باشه
# ستون 'feshar' اوکیه
# ستون 'estehkam' هم یک null داره



#------------ یک راه دیگه استفاده از isnull هست ----------

# این روش فقط برای دیتای کم کاربرد داره
data.isnull()
'''
     dama  feshar  estehkam
0   False   False     False
1   False   False     False
2   False   False     False
3   False   False     False
4   False   False     [True]
5   False   False     False
6   False   False     False
7   False   False     False
8   [True]  False     False
9   False   False     False
10  False   False     False
'''

# بهترین حالت در این روش استفاده از متود Sum هست
# این متود میاد true false هارو میشمره و بهمون میگه
# الان میگه توی ستون 'dama' و 'estehkam' متد isnull یک بار توی هر ستون True شده
# پس توی این ستون ها به همین تعداد null داریم

data.isnull().sum()
'''
dama        1
feshar      0
estehkam    1
dtype: int64
'''




# ==== چطوری این مشکل رو حل کنیم؟ ====

# ---------- متد dropna -----------
# یک روش استفاده از متود dropna هست که میاد هر ردیفی null داره رو کلا حذف میکنه
# از معایب این روش اینه که باید دیتارو بندازیم دور
# اگر دیتای ما حساس و گرون نباشه میشه ازین روش استفاده کرد
# ولی اگه دیتای مهم و حساسی داشته باشیم از روشهای دیگه باید استفاده کرد

data.dropna()  #data.dropna(inplace=True)
'''
     dama feshar  estehkam
0    40.0     '1'     400.0
1    50.0     '2'     500.0
2    60.0     '3'     600.0
3    70.0     '4'     700.0
5    90.0     '6'     900.0
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''


data['dama'].dropna()
'''
0      40.0
1      50.0
2      60.0
3      70.0
4      80.0
5      90.0
6     100.0
7     120.0
9     160.0
10    100.0
Name: dama, dtype: float64
'''


# ---------- متد fillna -----------
# این روش برای اینکه دیتایی رو اجبارا حذف نکنیم کاربرد داره
# میاد یک عدد میذاره جای هر خونه‌ای که null هست

data.fillna(10) #inplace=True
'''
     dama feshar  estehkam
0    40.0     '1'     400.0
1    50.0     '2'     500.0
2    60.0     '3'     600.0
3    70.0     '4'     700.0
4    80.0     '5'      10.0
5    90.0     '6'     900.0
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
8    10.0     '9'    1200.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''

# یا میشه مثلا میانگین یک ستون رو حساب کنیم و بذاریم جای null

dama_mean = data['dama'].mean()    # 87.0
data.fillna(dama_mean)   # inplace=True
'''
     dama feshar  estehkam
0    40.0     '1'     400.0
1    50.0     '2'     500.0
2    60.0     '3'     600.0
3    70.0     '4'     700.0
4    80.0     '5'      87.0
5    90.0     '6'     900.0
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
8    87.0     '9'    1200.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''

# جایی که دیتای ما اعداد ترتیبی هستن میشه بیایم از یک روش دیگه استفاده کنیم
# توی این روش میتونیم جای null رو با اعداد خانه های قبل یا بعدش پر کنیم

data.fillna(method='ffill')    # forward fill (az ghabli)
'''
     dama feshar  estehkam
0    40.0     '1'     400.0
1    50.0     '2'     500.0
2    60.0     '3'     600.0
3    70.0     '4'     700.0
4    80.0     '5'     700.0
5    90.0     '6'     900.0
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
8   120.0     '9'    1200.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''

data.fillna(method='bfill')    # backward fill (az badi)
'''
     dama feshar  estehkam
0    40.0     '1'     400.0
1    50.0     '2'     500.0
2    60.0     '3'     600.0
3    70.0     '4'     700.0
4    80.0     '5'     900.0
5    90.0     '6'     900.0
6   100.0     '7'    1000.0
7   120.0     '8'    1100.0
8   160.0     '9'    1200.0
9   160.0    '10'    1300.0
10  100.0     '7'    1000.0
'''







#==========================
'''  2- Wrong format  '''
#==========================

# ممکنه دیتا با فرمت اشتباهی ذخیره شده باشه:
    # time --> str 
    # number --> str
    # float --> int 


# برای حل این مشکل میشه از متد info استفاده کرد
# اینجا گفته که تایپ ستون 'dama' و ستون 'estehkam' تایپ float هست
# ولی ستون 'feshar' رو زده object. این یعنی چی؟

data.info()
'''
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype  
---  ------    --------------  -----  
 0   dama      10 non-null     float64
 1   feshar    11 non-null     object 
 2   estehkam  10 non-null     float64
dtypes: float64(2), object(1)
'''

# پس از بررسی مشخص میشه که یک ستون با تایپ str ذخیره شده
# خب این ستون رو نمیشه کلا حذف کرد که. پس چیکار کنیم؟

print(type(data['feshar'].loc[0]))    # <class 'str'>
print(data['feshar'].loc[0])   # 1'



# to_numeric()
# اکثر وقتها یک تایپ srt داریم که میخوایم بشه number
# با استفاده از متود to_numeric میایم Str رو به number تبدیل میکنیم

data['feshar'] = pd.to_numeric(data['feshar'])



# astype()
# با این متود هم میشه تایپ رو تغییر بدیم

data['feshar'] = data['feshar'].astype(int)
data['feshar'] = data['feshar'].astype(float)


# to_datetime
# اگه تاریخ یک str بود میشه ازین متود استفاده کرد

data['time'] = pd.to_datetime(data['time'])


#==============================================
data['feshar'] = pd.to_numeric(data['feshar'])     # تایپ از رشته به عدد تغییر کرد
data.info()
'''
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype  
---  ------    --------------  -----  
 0   dama      10 non-null     float64
 1   feshar    11 non-null     int64     <---
 2   estehkam  10 non-null     float64
dtypes: float64(2), int64(1)
'''






#==========================
'''  3- Logical '''
#==========================

# مشکلات logical نه به تایپ مربوط هستن نه به null
# با متد describe میتونیم متوجه مشکل logical بشیم
# مثلا ما در ستون 'feshar' میبینیم عدد بالای 10 داریم در حالیکه اندازه گیری های ما نباید بالای 10 باشه
# یا مثلا قاعدتا نباید دمای بالای 100 داشته باشیم ولی در عمل میبینیم در ستون دما، دمای بالای 100 داریم
# پس میفهمیم که یک مشکل logical داریم

data.describe()
'''
             dama     feshar    estehkam
count   10.000000  11.000000    10.00000
mean    87.000000   5.636364   870.00000
std     35.605867   2.907670   305.68684
min     40.000000   1.000000   400.00000
25%     62.500000   3.500000   625.00000
50%     85.000000   6.000000   950.00000
75%    100.000000   7.500000  1075.00000
max    160.000000  10.000000  1300.00000
'''

# برای حل این مشکل میشه از دو روش استفاده کرد:
    # یا با استفاده از apply بیایم روی اون ستونی که میخوایم یک تغییری انجام بدیم    
    # یا از روشهای filtering استفاده کنیم    


#------ filtering --------

# اینجا میایم فیلتر میکنیم تا فقط ردیف هایی که خودمون میخوایم رو نشون بده
# میایم میگیم در ستون دما فقط اونهایی که دمای زیر 100 دارن رو نشون بده

data = data[data['dama']<=100]
print(data)
'''
     dama  feshar  estehkam
0    40.0       1     400.0
1    50.0       2     500.0
2    60.0       3     600.0
3    70.0       4     700.0
4    80.0       5       NaN
5    90.0       6     900.0
6   100.0       7    1000.0
10  100.0       7    1000.0
'''







#===================================
'''  4- duplciated (tekrari) '''
#===================================

# اول از همه باید از خودمون بپرسیم که آیا اجازه داریم در این دیتا، ردیف تکراری داشته باشیم یا نه؟
# اگه اجازه داریم که اوکیه
# اگه نه باید حذف بشه
# البته وجود داده تکراری در کل غیرضروریه و باید حذف بشه
# در این مثال ردیف 6 و 10 دیتای تکراری داره

#------- drop_duplicates() ----------

data.drop_duplicates(inplace=True)       # تکراری هارو حذف کرد
print(data)
'''
    dama  feshar  estehkam
0   40.0       1     400.0
1   50.0       2     500.0
2   60.0       3     600.0
3   70.0       4     700.0
4   80.0       5       NaN
5   90.0       6     900.0
6  100.0       7    1000.0
'''


#--------- subset option ------------
# مورد specific
# استفاده از این آپشن در شرایط خیلی خاص که میخوایم فقط یک دیتای خاص در یک ستون تکراری نباشه کاربرد داره
# استفاده ازین مورد خطرناکه چون اگه مثلا 5 تا ردیف باشه که در ستون 'dama' مقدار برابر داره، همشون حذف میشن
# حتی اگه در بقیه ستون ها مقادیر متفاوتی داشته باشه

# پس فقط باید در موارد خیلی خاص مثل ID یا شماره ملی و ... که اصلا نباید تکراری باشه، کاربرد داره

# data.drop_duplicates(subset=['dama'],inplace=True)
# الان این خط میاد در ستون دما هرچی مقدار تکراری داره حذف میکنه

#===============================================================================









#============================================
#============================================
#========                            ========
#=====           Final Touch            =====
#========                            ========
#============================================
#============================================

# در انتهای پروسه data cleaning باید مراحل زیر برای بررسی نهایی و ذخیره دیتای تمیز شده انجام بشه

# بررسی نهایی
data.info
data.reset_index
data.head
data.tail

# ذخیره دیتای تمیز شده
data.to_excel('/Users/apm/Desktop/cleaned_data_15khordad.xlsx')






