
'''
===============================================================================
===============================================================================
================       Created on Thu Jul  2 12:05:33 2026     ================
================                IDE: Spyder                    ================
================         Author: Khashayar Alipour             ================
================               ML, Regression                  ================
===============================================================================
===============================================================================
'''






'''
=================================================
=================================================
=======   Machine learning introduction   =======
=================================================
=================================================
'''



# ماشین لرنینگ حدود 80% از مبحث AI رو تشکیل میده
# بقیش rule-based، symbolic و ... هست

# Machine learning :
    # 1- Supervised Learning 
    # 2- Unsupervised Learning 
    # 3- Reinforcement Learning (RL) 
    # 4- Deep learning (DL)



#==========================
''' supervised learning '''
#==========================
# براساس نوع خروجی 2 گروه میشه:

# 1-supervised regression --> خروجی بصورت پیوسته میباشد
# input[x] --> continous output[x]     
# چند مثال:
# قیمت کریپتو    
# اندازه استحکام در یک آزمایش علمی (مثلا 10، 112، 58.5)    


# 2-unsupervised classification --> خروجی بصورت دسته بندی و ناپیوسته هست
# input[x] --> discrete output[x]
# چند مثال:
    # روزهای هفته (شنبه، یکشنبه، ...)    
# ایمیل های ورودی spam هست یا نه    
# قیمت کریپتو افزایش پیدا کرده یا نه    



#============================
''' Unsupervised learning '''
#============================
# در دسته بندی supervised ما در ورودی یک input(x,y) داشتیم
# اینو وقتی میدادیم به مدل، هم x داشت و هم y داشت
# حالا مدل میرفت رابطه بین x و y رو پیدا میکرد
# حالا اگه y نداشته باشیم چی میشه؟

# یه چیزی داریم به اسم clustering یا خوشه کردن
# مثلا کلی عکس از سگ و گربه داریم که میدیم به یک مدل و میگیم دسته بندی کن
# یعنی ورودی x رو داریم. ولی عکسها هیچکدوم label ندارن پس y نداریم
# با اینحال مدل میاد بر اساس ویژگی های تصاویر مثل رنگ و پیکسل و ... خودش دسته بندی میکنه
# میاد میگه اینا 2 گروه هستن ولی نمیدونه یک گروه سگ هست یه گروه گربه. به این نوع دسته بندی میگن cluster کردن
# به این میگن unsupervised classification که بدون y اینکار رو انجام داد

# در دنیای واقعی اینقد حجم دیتا زیاده که نمیشه لیبل بزنیم پس بصورت unsupervised پردازش میشن
# حالا اگه برای هر عکس لیبل بزنیم میشه supervised

# یک مثال دیگه از cluster کردن بصورت unsupervised در سایتهای فیلم و سریال هست
# تعداد زیادی فیلم به عنوان ورودی وارد میشه و هیچکدوم لیبل ندارن
# ولی بر اساس یک سری Criteriaهای داخلی میاد cluster میکنه به ژانرهای مختلف




#====================
''' Deep learning '''
#====================

# حالا اگه تعداد دیتا خیلی خیلی زیاد باشه حالتهای supervised و unsupervised جوابگو نیستن
# باید بریم سراغ الگوریتمهای پیشرفته تر که عمیق تر هستن و لایه‌ها و پارامترهای بیشتری دارن



#=============================
''' Reinforcement learning '''
#=============================

# در تمام مدلهای بالا دیتای ما آماده بود و میدادیم به مدل و آنالیز میکرد
# حالا ما میخوایم مدل خودش بره توی محیط و بصورت پیوسته دیتا بگیره و آموزش ببینه
# این مدل در حیطه رباتیک یا ماشینهای خودران اکثرا استفاده میشه

# در مدلهای قبلی دقت ثابت بود مثلا روی 92% فیکس بود و تغییر نمیکرد مگه اینکه مثلا با fine tuning یکم افزایشش بدیم
# ولی در RL هرچی بیشتر یاد میگیره دقتش بالاتر میده تا اینکه به حد اشباع یا Saturation برسه

 









'''
========================================
========================================
=======   statistic regression   =======
========================================
========================================
'''


#============================
''' Regression definition '''
#============================

# یک مثال
# مثلا یک دستگاهی داریم که یه پارامترهایی از ما میگیره و یه محصولی میسازه
# دما و فشار و استحکام محصول
# آیا با افزایش دما استحکام بیشتر میشه؟ یا کمتر؟
# تنها راهی که میشه به این سوال جواب داد به روش آماری هست مثلا استفاده از ANOVA

# حالا فرض میکنیم با تستهای آماری فهمیدیم که دما در استحکام تاثیر داره
# حالا میخوایم بررسی کنیم که رابطه مستقیم دارن یا عکس؟ یا چیز دیگه؟
# تا تست نکنیم و دیتاهارو بررسی نکنیم نمیشه به این سوال جوال داد
# وقتی بتونیم یک رابطه بین این دو پیدا کنیم میتونیم پیشبینی کنیم
# temperatur -> [x] -> استحکام

# Dama(C) Estehkam (mPa)
#   50       510
#   60       590
#   70       713
#   80       810
#   90       905
#   100      996

# به پروسه پیدا کردن رابطه یا فرمول بین مثلا دما و استحکام میگن رگرسیون
# رگرسیون یک متود آماری هست که در آن رابطه بین x و y رو درمیاریم

# اگه بخوایم بخوایم واقعا ببینیم که مثلا دما تاثیری روی استحکام داره یا نه از روشهایی مثل ANOVA باید بررسیش کنیم
# با روش pearson میتونیم بفهمیم که correlation بین این دو وجود داره یا نه

# در طبیعت واقعا یک رابطه بین دما و استحکام وجود داره. ولی این رابطه رو هیچکی نمیدونه
# برای همین در یک آزمایش باید با روشهای مربوطه رابطه بین x و y پیدا بشه تا بتونیم شرایط رو پیشبنی کنیم


#------------------------------------------------------------------------------
# در این مثال ما دیتاهایی ساختیم که بیانگر دما و استحکام هستن
# میایم نمودارش رو رسم میکنیم و حالا میخوایم ببینیم این نقاطی که رسم شده چه رابطه ای بهم دارن

import numpy as np

#import pandas as pd
#df = pd.read_csv('user/apm/data.csv')
#temp = df['temp']
#estehkam = df['estehkam']


temp = np.array([50,60,70,80,90,100])
estehkam = np.array([520,580,723,813,925,996])
#x --> temp vorodi
#y --> estehkam khroji

import matplotlib.pyplot as plt

plt.scatter(temp,estehkam)
plt.title('examination')
plt.ylabel('estehkam (mPa)')
plt.xlabel('dama (C)')
plt.grid()
plt.show()


# چجوری روی یک نمودار بفهمیم نقاط باهم چه رابطه ای دارن؟ باید با خط مستقیم بهم وصلشون کنیم
# چجوری توی نمودار یک خط راست رسم کنیم؟ با فرمول y=a*x + b
# در این رابطه x و y نقاط هستند، a شیب خط هست و b خط رو بالا و پایین میبره
# اگه یک انسان بخواد بصورت دستی یک خط روی نمودار جوری رسم کنه که همه نقاط رو بهم متصل کنه
# باید بصورت دستی مدام a و b رو کم و زیاد کنیم تا بلخره به نتیجه مورد نظر برسیم
# و همانطور که در نمودار مشخص هست بلخره در curve14 به نتیجه معقول رسیدیم و خطی رسم کردیم که تقریبا همه نقاط رو بهم وصل کنه

temp = np.array([50,60,70,80,90,100])
estehkam = np.array([520,580,723,813,925,996])
#x--> temp vorodi
#y --> estehkam khroji

x = np.arange(50,101)
a=9.5
b=27
y15 = a*x + b

y11 = 9.5 * x + 150
y13 = 9.5 * x + 120
y14 = 10 * x + 19

plt.scatter(temp,estehkam,label='experimental')

plt.plot(x,y11,label = 'Curve11')
plt.plot(x,y13,label = 'Curve13')
plt.plot(x,y14,label = 'Curve14(ok)')
plt.plot(x,y15,label = 'Curve15')

plt.title('experiment')
plt.ylabel('estehkam (mPa)')
plt.xlabel('dama (C)')
plt.legend()
plt.grid()
plt.show()

# با این اوصاف و اندازه گیری هایی که در بالا انجام دادیم میتونیم بصورت حدودی بگیم که ما رابطه دما و استحکام رو پیدا کردیم:
    # estehkam = 10*dama + 19
#------------------------------------------------------------------------------






#===================================
''' concept of linear regression '''
#===================================
# ما با سعی و خطا به رابطه دما و استحکام رسیدیم ولی میتونیم یک تابع بسازیم که بیاد اینارو خودش بجای ما حساب کنه
# و در نهایت رابطه‌ای که دنبالش هستیم رو برای ما پیدا کنه
# رگرسیون میاد در پشت صحنه خودش بارها همین خطی که ما رسم کردیم رو حساب میکنه و هر دفعه فاصله خط با هر نقطه رو حساب میکنه
# در واقع میاد MSE (Mean squared Error) رو حساب میکنه
# که میشه فاصله خط با یک نقطه به توان دو (علت توان 2 اینه که قدرمطلق بدست بیاد و اگه فاصله خط با 2 نقطه پشت سر هم + و - شدن همدیگه رو حذف نکنن)
# سپس میاد تمام MSE هایی که حساب کرده رو باهم جمع میکنه و ازشون میانگین میگیره که یه عددی بدست میاد که بهش میگن cost function

#cost function
# line1(a1,b1) --> MSE1
# line2(a2,b2) --> MSE2
# line2(a2,b2) --> MSE3
# ...   ...        ...

# هدف ما اینه که این cost function رو تا جای ممکن minimize کنیم تا ارور کم بشه
# یعنی باید خطی رو در نهایت پیدا کنیم که کمترین MSE رو داشته باشه
# این خط یک a و b داره که میشه باهاش رابطه y=a*x + b رو پیدا کرد و رابطه x با y درمیاد
 

# در ادامه یک تابع میسازیم که عملکرد کلی linear regression به همین صورت هست

import numpy as np

def linear_regression(x,y):

    candidates=[]

    best_mse = 100000000
    best_a = 0
    best_b = 0

    for a in range(0,101):
        for b in range(0,1001):
            prediction = a*x + b 
            error = y - prediction
            mse = np.mean(error**2)

            candidate_dict= {'mse':mse ,'prediction' : prediction , 'error': error , 'a':a ,'b':b }
            candidates.append(candidate_dict)

            if mse<best_mse:
                best_mse= mse
                best_a = a
                best_b = b
                
    return candidates, best_mse , best_a, best_b


# حالا میایم همون کاری که بصورت دستی انجام دادیم و خط رسم کردیم
# با کمک این فانکشن Regression که ساختیم انجام میدیم
# در رسم میبینیم که ماشین چطور هزاران نقطه a و b رو تست میکنه تا اونی رو پیدا کنه که کمترین cost function رو داره

temp = np.array([50,60,70,80,90,100])
estehkam = np.array([520,580,723,813,925,996])
candidates , mse , a , b = linear_regression(temp,estehkam)
print('candidates: ' , candidates[0:10])
print('behtarin MSE:', mse)
print('best A : ',a)
print('best B: ', b)
print(f'Line : y = {a}*x + {b} ')

# تابع با دیتاهای بالا محاسبات زیر رو انجام میده و سپس به نتیجه های زیر میرسه:
# candidates:  [{'mse': np.float64(606356.5), 'prediction': array([0, 0, 0, 0, 0, 0]), 'error': array([520, 580, 723, 813, 925, 996]), 'a': 0, 'b': 0}, 
#               {'mse': np.float64(604838.5), 'prediction': array([1, 1, 1, 1, 1, 1]), 'error': array([519, 579, 722, 812, 924, 995]), 'a': 0, 'b': 1}, 
#               {'mse': np.float64(603322.5), 'prediction': array([2, 2, 2, 2, 2, 2]), 'error': array([518, 578, 721, 811, 923, 994]), 'a': 0, 'b': 2}, 
#               {'mse': np.float64(601808.5), 'prediction': array([3, 3, 3, 3, 3, 3]), 'error': array([517, 577, 720, 810, 922, 993]), 'a': 0, 'b': 3}, 
#               {'mse': np.float64(600296.5), 'prediction': array([4, 4, 4, 4, 4, 4]), 'error': array([516, 576, 719, 809, 921, 992]), 'a': 0, 'b': 4}, 
#               {'mse': np.float64(598786.5), 'prediction': array([5, 5, 5, 5, 5, 5]), 'error': array([515, 575, 718, 808, 920, 991]), 'a': 0, 'b': 5}, 
#               {'mse': np.float64(597278.5), 'prediction': array([6, 6, 6, 6, 6, 6]), 'error': array([514, 574, 717, 807, 919, 990]), 'a': 0, 'b': 6}, 
#               {'mse': np.float64(595772.5), 'prediction': array([7, 7, 7, 7, 7, 7]), 'error': array([513, 573, 716, 806, 918, 989]), 'a': 0, 'b': 7}, 
#               {'mse': np.float64(594268.5), 'prediction': array([8, 8, 8, 8, 8, 8]), 'error': array([512, 572, 715, 805, 917, 988]), 'a': 0, 'b': 8}, 
#               {'mse': np.float64(592766.5), 'prediction': array([9, 9, 9, 9, 9, 9]), 'error': array([511, 571, 714, 804, 916, 987]), 'a': 0, 'b': 9}]
# behtarin MSE: 266.5
# best A :  10
# best B:  9
# Line : y = 10*x + 9    در نهایت فرمول خط رو این حساب کرد


# حالا در ادامه میایم پروسه پیدا کردن فرمول نهایی توسط تابع رگرسیون رو با اعداد بالا رسم میکنیم

all_mse = [c['mse'] for c in candidates]
all_a = [c['a'] for c in candidates]
all_b = [c['b'] for c in candidates]

plt.plot(all_a,all_mse)
plt.title('MSE vs a')
plt.ylabel('MSE')
plt.xlabel('a')
plt.grid()
plt.show()

plt.plot(all_b,all_mse)
plt.title('MSE vs b')
plt.ylabel('MSE')
plt.xlabel('b')
plt.grid()
plt.show()


# حالا میایم خطی که دستی پیدا کردیم و خطی که تابع linear regression پیدا کرده در کنار هم رسم میکنیم

temp = np.array([50,60,70,80,90,100])
estehkam = np.array([520,580,723,813,925,996])

x= np.arange(50,101)

dasti = 10 * x + 19
LR = 10 * x + 9

plt.scatter(temp,estehkam,label = 'experimental')
plt.plot(x,dasti,label = 'ensan')
plt.plot(x,LR , label = 'linear regression')

plt.title('Linear regression results')
plt.ylabel('Estehkam (mPa)')
plt.xlabel('Dama (C)')
plt.legend()
plt.grid()
plt.show()


# به علت خطاهای اندازه گیری و ... این خطی که دستی پیدا کردیم هیچوقت روی خطی که ماشین پیدا میکنه نمیوفته
# همچنین پروسه پیدا کردن خط بصورت دستی خیلی زمان بیشتری میبره تا ماشین

# حالا که رابطه بین x و y رو پیدا کردیم میتونیم پیشبینی انجام بدیم
# یک تابع میسازیم، x رو بهش میدیم و با تقریب خوبی y رو محاسبه میکنه

def predcition(x):
    linearRegression = 10 * x + 9
    print(linearRegression)

predcition(50)  #509
predcition(60)  #609
predcition(80)  #809









#=============================
''' real linear regression '''
#=============================

# در عمل چیزی که در مثال بالا در رگرسیون دیدیم کاربردی نداره
# یعنی اینقد حجم دیتا زیاده که به این سادگی نیست
# وقتی دیتا خیلی زیاد باشه نمیتونه دونه دونه a بذاره و بررسی کنه بهترین خط چیه
# در این حالت از روشهای هوشمند و optimization استفاده میکنه

# از روشی مثل gradient decent یا گرادیان کاهشی استفاده میشه
# در این روش نمیاد a رو از 0 شروع کنه. میاد یه a بصورت رندوم انتخاب میکنه
# سپس مشتق نقطه رو حساب میکنه که میشه شیب نمودار توی اون نقطه
# اگه شیب رو به بالا باشه اصلا اون a رو ادامه نمیده و میره پایین تر
# اگر شیب منفی باشه مشتق رو ضرب در یک عدد بنام learning rate میکنه
# اینقد این کار رو انجام میده تا به یک a برسه که توی اون نقطه MSE در حالت مینیمم خودش هست
# اینجوری بجای اینکه مثلا 1 میلیون حالت رو بررسی کنه با بررسی 100 حالت به جواب میرسه
# البته این روش معایب خودشم داره، مثلا learning rate باید عدد مناسبی باشه و ...
# یک عیب دیگه اینه که ممکنه در local minima گیر کنه، یعنی یک جای نمودار یک دره باشه 
# ولی اونجا کمترین MSE در کل نمودار رو نداشته باشه ولی تابع فکر میکنه که نقطه ای که باید پیدا کنه همونجاست
# به پایین ترین نقطه MSE که باید تابع پیدا کنه میگن general minima

import numpy as np
a = np.arange(0,10)
mse = np.array([500,400,300,200,100,150 , 260 , 300 , 400 , 500])

plt.plot(a,mse)
plt.title('MSE vs a')
plt.ylabel('MSE')
plt.xlabel('a')


# فرق دوم با واقعیت اینه که ممکنه چندتا x داشته باشیم یعنی چندتا ورودی داشته باشیم
# estehkam = a * dama + b * speed + c
# اینجوری باید a و b و c رو حساب کنه
# در این حالت مثلا بجای اینکه در نمودار 2 بعدی دنبال کمینه MSE بگرده باید در یک صفحه 3 بعدی دنبال MSE باشه
# اگه لازم باشه و تعداد ورودی بیشتر باشه در یک صفحه 4بعدی میگرده







#===================
''' scikit-learn '''
#===================

# pip install scikit-learn
# Scikit-learn (also written as sklearn) is a popular open-source Python library for machine learning
# Built on top of NumPy, SciPy and Matplotlib, it provides efficient tools for data analysis and predictive modeling


from sklearn.linear_model import SGDRegressor
#schotastic gradient descent regression --> Linear regressor

# اول میایم مدل خودمون رو درست میکنیم
model = SGDRegressor(loss = 'squared_error',learning_rate='constant',eta0=0.0001 , max_iter=10000,random_state=42)
# eta = learning rate  یک عدد هست که اگه حدس اولیه ما درست نبود عددش رو کمتر میکنیم
# learning_rate=constant  یعنی ثابت باشه و داینامیک نباشه
# max_iter | random_state  اینا همیشه عددهاشون همینا هست
# Loss function -> فاصله بین نقاط و خطها به توان 2 و در نهایت یک میانگین
# learning rate --> همون پارامتری که در مشتق ضرب میشد
# max iter --> iteration --> 1000   اگر حدس اولیه ما درست نبود اینو بیشتر میکنیم
# random state --> chooses the initial a,b
# random_state --> 42 


temp = np.array([50,60,70,80,90,100])
estehkam = np.array([520,580,723,813,925,996])

# اگر x یک بعدی بود الزام تابع هست که reshape(-1,1) رو بزنیم ولی اگه 2 بعدی بود لازم نیست
# الان به fit باید x و y رو بدیم که میشن همون دما و استحکام
model.fit(temp.reshape(-1,1), estehkam) #fit , train --> mire linear regresion  --> random a , b gradient descn hoshmand line haye motefavet , loss mse -->kamtrin

# وقتی این fit اجرا بشه linear regressor میاد با روشهای هوشمند مثل گرادیان کاهشی a و b رو اول رندوم انتخاب میکنه
# و کم کم لایه های مختلف رو تست میکنه و کمترین loss MSE رو محاسبه میکنه
# درواقع در این مرحله مدل train میشه و این چیزایی که وارد کردیم در داخل مدل fit میشه
# SGDRegressor(eta0=0.0001, learning_rate='constant', max_iter=10000, random_state=42)


#======== Prediction =========
# بعد از train شدن مدل داخل مدل یک coef و یک intercept داریم که همون a و b ما هستن
a = model.coef_  #a 
b = model.intercept_ #b
print('a:',a)   #[10.01482719]
print('b:',b)   #[0.1178346]

print ("prediction: ",a * 50 + b)    # بهش 50 دادیم و 500 محاسبه کرد که با تقریب خوبی به عدد واقعی (520) نزدیکه


# بجای روش بالا میشه از تابع predict هم استفاده کرد
model.predict(np.array([50]).reshape(-1,1))    #500


# اینم یک رسم از prediction که انجام دادیم
x= np.arange(50,101)
y = model.predict(x.reshape(-1,1))

plt.scatter(temp,estehkam,label='experimental')
plt.scatter(x,y,label='SGD Regressor')
plt.title('Linear regression')
plt.ylabel('Estehkam (mPa)')
plt.xlabel('dama (C)')
plt.grid()
plt.legend()
plt.show()
































































