
'''
===============================================================================
===============================================================================
================       Created on Sun Aug  2 12:08:58 2026     ================
================                IDE: Spyder                    ================
================         Author: Khashayar Alipour             ================
================              Statistical models               ================
================              AI Unsupervised ML               ================
===============================================================================
===============================================================================
'''

# Unsupervised learning concepts:
            #Dimensionality Reduction:
                   # PCA (Principal Component Analysis)
                   # KernelPCA
                   # t-SNE
                   # UMAP

# AI
# │
# └── ML
#     │
#     ├── Classical ML
#     │   │
#     │   ├── Supervised Learning
#     │   │   │                                
#     │   │   ├── Regression                   
#     │   │   │   │                            
#     │   │   │   ├── Linear Regression 
#     │   │   │   └── Nonlinear Regression 
#     │   │   │                                
#     │   │   └── Classification  
#     │   │                        
#     │   │                        
#     │   ├── Unsupervised Learning ⭐
#     │   │                   │
#     │   │                   ├── Clustering
#     │   │                   │   ├── KMeans  ⭐
#     │   │                   │   ├── Hierarchical  ⭐
#     │   │                   │   ├── DBSCAN  ⭐
#     │   │                   │   └── Gaussian Mixture  ⭐
#     │   │                   │
#     │   │                   ├── Dimensionality Reduction
#     │   │                   │   └── PCA
#     │   │                   │
#     │   │                   └── Association Rules
#     │   │                       └── Apriori / FP-Growth
#     │   │
#     │   │ 
#     │   ├── Semi-Supervised Learning
#     │   │
#     │   └── Reinforcement Learning
#     │
#     └── Deep Learning 


       



'''
==================================================
=======   Unsupervised Learning concepts   =======
==================================================
'''

# در supervised ما هم x داشتیم و هم y داشتیم و همشون label داشتن و رابطه بین آنها رو پیدا میکردیم
#  x       y
#| Area | Price |
#| ---- | ----- |
#| 100  | 500   |
#| 120  | 600   |

# ولی در unsupervised ما فقط کلی  x بدون label داریم و هیچ y نداریم و خودش الگوهای پنهان داخل داده را پیدا کند
#    x        x        y?
#| Height | Weight |   -
#| ------ | ------ |   -
#| 170    | 70     |   -
#| 180    | 85     |   -
#| 155    | 50     |   -

# کاربرد:
# گروه‌بندی مشتری‌ها    
# تشخیص رفتار کاربران    
# کاهش تعداد Featureها    
# پیدا کردن ارتباط بین کالاها    



"Clustering"
# فرض کن ۱۰۰ نفر داخل یک سالن هستند. هیچ اطلاعاتی از آن‌ها نداری. فقط قد و وزنشان را داری.
# مدل می‌گوید: این افراد را بر اساس شباهت گروه‌بندی می‌کنم

# مثلا مدل میاد 3 گروه میسازه
# کسی به مدل نگفته بود چند گروه وجود دارد یا اعضای هر گروه چه کسانی هستند
# 🔵🔵🔵🔵
# 🟢🟢🟢
# 🔴🔴🔴🔴🔴

# کاربرد:
# تقسیم مشتری‌ها    
# تقسیم تصاویر    
# تقسیم کاربران    
# خوشه‌بندی اسناد    




"Association Rules"
# فرض کن سوپرمارکت داری و می‌خواهی بفهمی مردم چه کالاهایی را با هم می‌خرند
# مثلا نان+پنیر

# مدل این رابطه‌ها را کشف می‌کند

# کاربرد:
# سیستم پیشنهاد کالا    
# پیشنهاد فیلم    
# پیشنهاد موسیقی    
# فروشگاه‌های اینترنتی    





"=== Dimensionality Reduction ==="
# فرض کن دیتاست ۲۰۰ ستون دارد. همه ستون‌ها مفید نیستند بلکه بعضی‌ها تقریباً یک اطلاعات مشابه دارند
# مثلا این دو ستون تقریبا یک اطلاعات دارن:
    # Height(cm)
    # Height(m)

# هدف این مفهوم کم کردن تعداد Featureها، بدون از دست دادن اطلاعات مهم است

# کاربرد:
# سریع‌تر شدن آموزش    
# کاهش حافظه    
# حذف نویز    
# رسم داده‌های چندبعدی    


# اگر feature ها خیلی زیاد باشن برای اینکه مهم هاشو برداریم از متودهای feature selection استفاده میکنیم
# ولی بعضی وقتا میخوایم کلا یه Representation دیگه ای از دیتا به مدل بدیم. در واقع میخوایم بُعدش رو بشکنیم
# محاسباتشون آسون تر میشه، مدل بهتر Feed میشه و ...
# بعضی وقتا مثلا میخوایم دیتای 3 بعدی تبدیل به 2 بعدی بشه تا مثلا توی visualization ازش استفاده کنیم


# اصلی ترین روش برای این کار استفاده از PCA هست
"✅ PCA (Principal Component Analysis)"

# فرض کن 50 تا Feature داری که بعضی از آنها تقریبا 1 چیز رو اندازه میگیرن. اینها اطلاعات تکراری دارن
# Weight (kg)     Height(cm)      Income
# Weight (lb)     Height(m)       Salary

# حالا PCA میاد میگه من بجای 50 تا، 5 تا feature جدید میسازم (new representation) که که همون اطلاعات رو داشته باشه
# before            after
# ------            -----
# Height            PC1
# Weight  --PCA-->  PC2
# BMI

# فرض کنیم 3 دوربین از یک ماشین عکس گرفتن و PCA میاد میگه من بجای اینها، یک عکس میسازم که خلاصه هر 3 باشد

# چه زمانی PCA خوب است؟
# وقتی Featureهای خیلی زیادی داری
# مثلاً:
# تصویر    
# متن    
# داده‌های ژنتیکی    
# صدها Feature    


# ❌ کلا PCA به y نگاه نمیکنه بلکه فقط به x نگاه میکنه
# به همین دلیل یک روش unsupervised هست

# Original Features  (1000 samples, 50 features)
#        ▼
#      scaling
#        ▼
#       PCA
#        ▼
#   New Features  (1000 samples, 2 features)
#        ▼
#      Model
    
    

from sklearn.datasets import make_blobs     # mock data
from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA

x,y = make_blobs(n_samples=300, centers=3, random_state=42)

# بهتره قبل از PCA دیتا scale بشه
scaler = StandardScaler()
x_scaled = scaler.fit_transfor(x)

pca = PCA(n_components=2)
x_new = pca.fit_transform(x_scaled)
# پارامتر n_components یعنی چند component از featureها برات بسازه -> PC1 / PC2




"✅ KernelPCA"
# اگر داده خطی نباشه PCA عملکرد خوبی نداره
# درواقع PCA میاد روی داده های خطی کار میکنه. روی نمودار یک محور جدید میکشه (محور قبلی رو میچرخونه)
# سپس دیتاهارو روی این محور جدید تصویر میکنه
# Height                   Height
# │     /                    |  \ 
# │    /                     |   \
# │   /          PCA ->      |    \
# │  /                       |     \
# │ /                        |      \
# └─────── Weight            └─────────── Weight
  # محور جدید               محور قدیم   

# درواقع kernelPCA نسخه پیشرفته‌تر PCA است که برای داده‌های غیرخطی (Nonlinear) ساخته شده است
# اگر نمودار داده ها غیر خطی (مثلا منحنی) باشه PCA دیگه کارایی نداره چون فقط دنبال خط راست میگرده
# ایده اصلی Kernel PCA اینه که میگه اگر داده‌ها در این فضا خطی نیستند، بیایید آن‌ها را به فضای دیگری ببریم که در آن خطی شوند

# فرض کنیم داده ها روی یک دایره رسم شده اند
# اینجا PCA فقط یک خط میبینه ولی Kernel PCA دایره رو به یک فضای جدید میبره
# در اون فضای جدید دایره تقریبا تبدیل به یک خط میشه سپس PCA روش اجرا میشه
#      ●  ●
#    ●      ●
#   ●        ●
#    ●      ●
#      ●  ●

#     PCA                   Kernel PCA
# --------------        ----------------
# Original Data           Original Data
#       ↓                         ↓
# Rotate Axes             Kernel Function
#       ↓                         ↓
# Reduce Dimension        Higher-dimensional Space
#                                 ↓   
#                                PCA               
#                                 ↓
#                         Reduce Dimension          

# حالا Kernel چیه؟
# یک تابع ریاضی است. کارش این است که بدون اینکه واقعاً داده را به فضای بزرگ‌تر منتقل کند،
# رفتارش را مثل آن فضا شبیه‌سازی کند. به این ترفند Kernel Trick می‌گویند
kernel="rbf"       # برای داده‌های غیرخطی
kernel="linear"    # PCA
kernel="poly"      # برای روابط چندجمله‌ای
kernel="sigmoid"   # شبیه نورون‌های اولیه


#===== sklearn ======
from sklearn.decomposition import KernelPCA

kpca = KernelPCA(n_components=2, kernel="rbf")
X_train_new = kpca.fit_transform(x)

# با fit مدل فضای جدید رو یاد میگیره
# با transform داده ها به آن فضای جدید منتقل میشن

# مثلا خروجی x_new این میشه:
[[ 1.2 , -0.8]
 [ 0.5 , 2.1]
 [-1.4 , 0.7]]

x_test_new = kpca.transform(x_test)  # پیشبینی برای دیتای جدید



"✅ t-SNE"
# بعد از PCA و Kernel PCA، معروف‌ترین روش کاهش ابعاد t-SNE است
# در کل t-SNE یک الگوریتم برای Visualization (نمایش داده‌ها) است، نه برای ساخت Feature جدید جهت آموزش مدل
# یعنی اگر هدفت آموزش یک مدل Machine Learning باشد، معمولاً PCA انتخاب بهتری است
# اما اگر بخواهی داده‌ها را ببینی و الگوها را کشف کنی، t-SNE فوق‌العاده است

# فرض کنیم دیتاستی داریم با 100 عدد feature
# یعنی هر نمونه داخل فضایی 100 بعدی قرار داره
# انسان نهایتا میتونه در فضای 3 بعدی چیزی رو ببینه
# هدف t-SNE اینه که 100 تا Feature رو به 2 یا 3 تا تبدیل کنه تا بشه در فضای 2 یا 3 بعدی نمودارش رو رسم کرد

# کلا t-SNE میگه من فاصله همه نقاط را حفظ نمی‌کنم بلکه همسایه‌های نزدیک هر نقطه را حفظ می‌کنم
# این مهم‌ترین تفاوت t-SNE با PCA است

# مثلا فرض میکنیم این 3 نفر کنار هم هستن:
# Ali
# Reza
# Sara
# و اینجا t_SNE میاد میگه مهم نیست کل شهر چه شکلی باشن. مهم اینه علی کنار رضا و رضا کنار سارا باشه
# یعنی فقط مهمه واسش که همسایگی حفظ بشه


# حالا چطوری کار میکنه؟
# مرحله 1- برای هر نقطه نزدیک‌ترین همسایه‌هایش را پیدا می‌کند
# A
# ↓
# B
# ↓
# C
# مرحله 2- یک فضای دو بعدی می‌سازد. ابتدا نقاط کاملاً تصادفی هستند
# ●
#     ▲
#         ■
# مرحله 3- کم‌کم نقاط را جابه‌جا می‌کند. اگر دو نقطه در فضای اصلی نزدیک بودند
# در نمودار هم آن‌ها را نزدیک می‌کند. اگر دور بودند از هم دور می‌کند. این کار بارها تکرار می‌شود.

# نتیجه: در پایان گروه‌ها از هم جدا می‌شوند.


# PCA             t-SNE
# -----           -------
# Data             Data
#   ↓                ↓
# Rotation       Find Neighbors
#   ↓                ↓
# Projection      Move Points
#   ↓                ↓
#  2D         Keep Similar Points Together
#                    ↓
#                   2D    


from sklearn.manifold import TSNE

tsne = TSNE(n_components=2, perplexity=30, learning_rate=200, random_state=42)

X_tsne = tsne.fit_transform(X)

#  پارامتر n_components تعداد خروجی رو مشخص میکنه کنه 2D یا 3D باشه

# پارامتر perplexity میاد مشخص میکنه تقریباً چند همسایه برای هر نقطه مهم هستند و عدد های رایجش 5 و 30 و 50 هست
# هرچه مقدارش بزرگ‌تر باشد، مدل بیشتر به ساختار کلی داده توجه می‌کند و هرچه کوچک‌تر باشد، روی ساختارهای محلی تمرکز می‌کند

# پارامتر learning_rate سرعت جابجایی نقاط رو مشخص میکنه
# اگر خیلی کوچک باشد همگرا شدن کند می‌شود. اگر خیلی بزرگ باشد نمودار به‌هم می‌ریزد.

print(X_tsne)  # الان هر نمونه 2 مختصات داره و 2 بعدی شده
# [[ 12.3   5.4]
#  [ 10.2   7.8]
#  [ -8.4  15.6]]

import matplotlib.pyplot as plt
plt.scatter(X_tsne[:,0], X_tsne[:,1] )
plt.show()


"✅ UMAP"
# بعد از PCA، Kernel PCA و t-SNE، امروزه یکی از محبوب‌ترین روش‌های کاهش ابعاد UMAP است
# نکته مهم اینه که UMAP هم مثل t-SNE بیشتر برای Visualization استفاده می‌شود، اما برخلاف t-SNE می‌تواند برای
# کاهش بعد قبل از آموزش مدل هم گزینه خوبی باشد، چون سریع‌تر است و معمولاً ساختار کلی داده را بهتر حفظ می‌کند.

# هدف UMAP عین t-SNE هست که بعدهای دیتا رو کاهش بده به 2 یا 3 بعد تا انسان بتونه ببینه
# اما در عین حال تا جای ممکن ساختار واقعی داده را حفظ کند

# ایده اصلی UMAP اینه: مثلا توی یک شهر 20 نفر زندگی میکنن و هر نفر چند همسایه نزدیک داره
# اینجا UMAP میگه من ابتدا همسایه‌های هر نفر را پیدا می‌کنم
# Ali
#  ↓
# Reza   یعنی علی بیشتر با رضا ارتباط داره
#  ↓
# Sara
#  ↓
# Amir
# بعد UMAP یک نقشه دوبعدی می‌سازد. سعی می‌کند همین همسایه‌ها در نقشه جدید همچنان کنار هم بمانند

# pip install umap-learn

import umap

model = umap.UMAP(n_components=2, n_neighbors=15, random_state=42)
# پارامتر n_neighbors=15 مشخص میکنه هر نقطه چند همسایه رو در نظر بگیره

X_umap = model.fit_transform(X)
print(X_umap)
# [[ 4.5   1.2]
#  [ 3.9   0.7]
#  [-8.2   6.5]]

import matplotlib.pyplot as plt
plt.scatter(X_umap[:,0], X_umap[:,1])
plt.show()


# آیا UMAP می‌تواند داده جدید را Transform کند؟
# بله. این یکی از مزیت‌های مهم UMAP نسبت به t-SNE است
# بنابراین اگر بخواهی بعداً داده‌های جدید را هم به همان فضای کاهش‌یافته ببری، UMAP گزینه مناسب‌تری از t-SNE است

# آموزش روی داده آموزشی
model.fit(X_train)

# تبدیل داده آموزشی
X_train_umap = model.transform(X_train)

# تبدیل داده جدید
X_test_umap = model.transform(X_test)



"SUMMARY"
# ______________________________________________________________________________________________
# |                   ویژگی            |    PCA    |    Kernel PCA |     t-SNE   |      UMAP   |  
# |----------|---------------|-------------|--------------|-------------------------------------|
# |  نوع رابطه                         |     خطی      | غیرخطی     |    غیرخطی     |  غیرخطی |  
# |  سرعت                              | ⭐ خیلی سریع|  متوسط     |    ❌ کند     | ⭐ سریع |  
# | حفظ ساختار کلی داده               |   ⭐ عالی    |   خوب      |    ضعیف‌تر     | ⭐ خوب  |  
# |  حفظ همسایه‌های نزدیک              |     متوسط    |   خوب      |    ⭐ عالی    | ⭐ عالی |  
# |  مناسب برای Visualization          |       خوب    |   خوب      |    ⭐ عالی    | ⭐ عالی |  
# | مناسب برای کاهش بعد قبل از ML     |     ⭐ بله  |  ⭐ بله    |    معمولاً خیر  | ⭐ بله  |  
# | امکان transform() روی داده جدید    |    ✅ بله   | ✅ بله     | ❌ معمولاً خیر | ✅ بله  |  
# -----------------------------------------------------------------------------------------------


# چه زمانی از هر کدام استفاده کنیم؟
# مدل PCA: وقتی داده تقریباً خطی است، سرعت و سادگی مهم است و می‌خواهی قبل از آموزش مدل، ابعاد را کم کنی.
# مدل Kernel PCA: وقتی داده غیرخطی است اما همچنان می‌خواهی یک روش کاهش بعد برای استفاده در مدل‌های ML داشته باشی.
# مدل t-SNE: وقتی هدف اصلی، نمایش داده‌ها و دیدن خوشه‌ها و الگوهای پنهان است.
# مدل UMAP: وقتی هم Visualization می‌خواهی و هم روشی سریع‌تر که بتواند برای داده‌های جدید نیز همان تبدیل را اعمال کند.








'''
================================================
=======   Unsupervised Learning Models   =======
================================================
'''


"K-Means Clustering"
# فرض کن روی زمین ۲۰۰ توپ رنگی ریخته شده و تو میگی: "من فکر می‌کنم این توپ‌ها باید در ۳ گروه قرار بگیرن"
# یعنی K = 3 و مدل KMeans دقیقاً همین عدد K را از تو می‌گیرد

# در مرحله بعد مدل از اونجایی که نمی‌داند مرکز هر گروه کجاست، به صورت تصادفی ۳ نقطه انتخاب می‌کند
# به این مرکزهای اولیه که با ✖ مشخص کردیم، Centroid میگن
# 🔵🔵🔵
#  🔵 ✖      🔵🔵 
#        
#    🟢    
#   🟢   ✖🟢🟢        
#
#            🔴🔴
#       🔴🔴    ✖     🔴         

# حالا هر نقطه به نزدیک ترین centroid به خودش میده
# 🔵 -> first centroid
# 🔴 -> second centroid
# 🟢 -> third centroid


# در مرحله بعد مدل میگه : مرکز واقعی مثلا این گروه 🔵 اینجا نیست. بیایید میانگین تمام نقاط آن گروه را حساب کنیم
# سپس از روی همین حساب میاد یک مرکز جدید ✖ مشخص میکنه تا نقاط دوباره جابجا بشن
# به همین دلیل اسمش K-Means است. چون مرکز هر خوشه برابر Mean اعضای آن خوشه است

# در مرحله بعد بازم میاد به همین روش مرکزهارو جابجا میکنه
# این کار آن‌قدر تکرار می‌شود تا مرکزها دیگر تقریباً تکان نخورند

# نتیجه نهایی به اینصورت میشه:
    # Cluster 1 -> 🔵🔵🔵🔵🔵🔵
    # Cluster 2 -> 🟢🟢🟢🟢
    # Cluster 3 -> 🔴🔴🔴🔴🔴


# ✅ مزایا
# سریع
# ساده

# ❌ معایب
# باید k را خودت مشخص کنی
# برای داده‌های غیرکروی خوب نیست
# اگر داده ها شکل پیچیده داشته باشن خوب تشخیص نمیده
# این روش به Scaling حساس هست
# به نقاط پرت (outlier) حساس هست



#====❌ Problem ❌====
# حالا اگه تعداد خوشه های ما مشخص نباشه چیکار کنیم؟ از کجا بقهمیم باید چندتا خوشه باشه؟
# از روش elbow method استفاده میکنیم
# اگر k خیلی کوچک باشد چی میشه؟ مثلا در مثال زیر اگر k=2 باشه
# مجبور میشه از بین 3 گروه، دوتاش رو ترکیب کنه و 2 گروه بسازه
# 🔵🔵🔵 
#                       🔵🔵🔵🟢🟢🟢
# 🟢🟢🟢     k=2 -->   
#                       🔴🔴🔴
# 🔴🔴🔴

# حالا اگه مثلا واقعا 3 گروه باشه ولی k=5 بذاریم، مدل مجبور میشه بعضی گروه هارو به چند بخش تقسیم کنه
# 🔵🔵
# 🔵
# 🟢🟢
# 🔴
# 🔴🔴

# پس باید k های مختلف تست بشه تا معلوم بشه کدوم بهتره
# مدل برای هر k یک عدد بنام inertia یا WCSS(Within Cluster Sum of Squares) محاسبه میکنه
# وسط هر خوشه یه نقطه انتخاب کرده. میاد فاصله هر نمونه تا اون نقطه رو محاسبه میکنه
# سپس تمام این فاصله هارو به توان 2 میرسونه و باهم جمع میکنه که این میشه WCSS
# اگر نقاط خیلی بهم نزدیک باشن، WCSS کم میشه یعنی خوشه بندی خوب انجام شده
# اگر نقاط پراکنده باشن WCSS زیاد میشه و یعنی خوشه بندی ضعیف انجام شده
# هرچه K بیشتر بشه -> WCSS کمتر میشه چون خوشه ها کوچکتر میشن (تعدادشون بیشتر میشه)

#    WCSS
# 900 | ●
#     |
# 700 |
#     |
# 500 |    ●
# 300 |
#     |        ●
# 200 |             ●
#     |                  ●
# 100 |                      ●
#     +----------------------------  K
#       1   2   3   4   5   6   7


# ✅ Elbow method
# در نمودار بالا میبینیم که تا k=3 کاهش WCSS خیلی شیبش زیاده ولی از یه جایی به بعد شیب کاهش کم میشه
# یعنی ازونجا به بعد دیگه اضافه کردن خوشه فایده زیادی نداره
# به اون نقطه که نمودار اونجا میشکنه و حالتی شبیه آرنج دست به خودش میگیره میگن Elbow
# مفهوم این متود: به دنبال نقطه‌ای می‌گردیم که بعدش، اضافه کردن خوشه‌های جدید دیگر بهبود قابل توجهی ایجاد نکند
# بهترین k همون مقداری هست که ازونجا به بعد مقدار WCSS تغییر قابل توجهی نداشته
# | K | WCSS |
# | - | ---- |
# | 1 | 1000 |
# | 2 | 600  |
# | 3 | 250  |  --> best K
# | 4 | 220  |
# | 5 | 210  |
# | 6 | 205  |

# پس زمانیکه میخوایم از مدل استفاده کنیم، قبلش باید مدل رو ابتدا با چندین K آموزش بدیم
# تا در نهایت بهترین K پیدا بشه
#  این متود یک روش بصری (Visual Method) است یعنی در نهایت یک انسان با دیدن نمودار باید بهترین k رو تشخیص بده
# \
#  \
#   \  --> Elbow
#    |____

# نکته مهم اینه که روش Elbow همیشه دقیق و درست جواب نمیده
# گاهی نمودار آرنج واضحی ندارد و تشخیص آن سخت است. در این حالت معمولاً از معیارهای دیگری
# مثل Silhouette Score یا دانش مسئله (Domain Knowledge) هم استفاده می‌شود



#===== SKlearn =====
from sklearn.datasets import make_blobs
from sklearn.cluster import KMeans
import matplotlib.pyplot as plt

x,y = make_blobs(n_samples=300, centers=3, random_state=42)

# اینجا مقادیر 1 تا 10 برای K رو بوسیله حلقه میدیم به مدل تا بهترین مقدار مشخص بشه
wcss = []   # [1000, 620, 260, 220, 210, 205, 203, 202, 201, 200]
for k in range(1,11):
    model = KMeans(n_clusters=k, random_state=42 )
    model.fit(x)
    wcss.append(model.inertia_)

# رسم نمودار Elbow
# 👨 با نگاه کردن به نمودار تصمیم میگیریم بهترین مقدار برای k چی هست
plt.plot(range(1,11), wcss, marker="o")
plt.xlabel("Number of Clusters (K)")
plt.ylabel("WCSS (Inertia)")
plt.title("Elbow Method")
plt.grid(True)
plt.show()

# حالا که بهترین مقدار k مشخص شد دوباره مدل رو میسازیم
model = KMeans(n_clusters=3, random_state=42)  
model.fit(x)  # تمام پروسه انتخاب مرکز، جابجایی، میانگین و ... با این دستور انجام میشه
labels = model.labels_
centers = model.cluster_centers_
new_label = model.predict(new_data)

# n_clusters=3 -> تعداد خوشه ها
# random_state=42 -> یه عدد ثابت میذاریم تا هر بار همان مرکزهای اولیه انتخاب بشن

# labels = model.labels_ -> برچسب هر نمونه رو مشخص میکنه
# 0 --> first sample is in cluster 0
# 0 --> second sample is also in cluster 0
# 1 --> third sample is in cluster 1
# 2 --> fourth sample is in cluster 2

# model.cluster_centers_ -> مختصات مرکز خوشه‌ها رو بهمون میده
[[3.2 , 5.1]
 [9.4 , 2.7]
 [1.8 , 8.3]]


# ____________________مثال واقعی______________
from sklearn.datasets import make_blobs
from sklearn.cluster import KMeans
import matplotlib.pyplot as plt

x,y = make_blobs(n_samples=300, centers=3, random_state=42)

plt.scatter(x[:,0], x[:,1] )
plt.xlabel("Feature 1")
plt.ylabel("Feature 2")
plt.title("Scatter plot of features")
plt.show()

model = KMeans(n_clusters=3, random_state=42)
model.fit(x)

y_pred = model.labels_
print(y_pred[0:10])    # [1 1 0 2 1 2 0 2 0 0]

model.cluster_centers_
# [[-2.63323268,  9.04356978],
#  [-6.88387179, -6.98398415],
#  [ 4.74710337,  2.01059427]]

new_points = [[2,5]]
model.predict(new_points)   # array([2], dtype=int32)    خوشه شماره 2

# رسم نقاط center که توسط مدل انتخاب شدن
plt.scatter(x[:,0], x[:,1], c=y_pred)
plt.scatter(model.cluster_centers_[:,0], model.cluster_centers_[:,1], s=200, c="red", marker="x")
plt.show()
#_______________________________________






"Hierarchical Clustering"
# ایده پشت این مدل اینه: فرض کنیم 10 نفر داریم
# به مدل میگیم مثلا 2 تا خوشه بهمون بده
# A
# B
# C
# ...
# J

# حالا نزدیک ترین 2 نفر به هم نزدیک میشن:
# AB  CD   EF  GH  I  J
# دوباره نزدیک ترین ها در هر گروه به هم وصل میشن:
# ABCD  EFGH  IJ
# همینجوری ادامه پیدا میکنه تا در نهایت به clustering موردنظر ما برسه:
# ABCD=cluster0   EFGHIJ=cluster1

# در نتیجه یک درخت ساخته میشه که به این شکل Dendrogram میگن
# مهمترین نوع Hierarchical Clustering که مورد استفاده هست اسمش Agglomerative clustering هست
# این درخت از پایین شروع میشه و حرکت میکنه تا بالا
    
#    ABCD    EFGHIJ
#    /        /   \
#  ABCD     EFGH  IJ  
#  /  \     /  \  
# AB  CD   EF  GH  I  J


# فرق این روش با KMeans اینه که KMeans از اول تعداد خوشه را می‌خواهد
# ولی Hierarchical اول درخت می‌سازد. بعد تو تصمیم می‌گیری درخت را از کجا ببری
# مثلا از خوشه 3 یا خوشه 5

# ✅ چه زمانی خوب است؟
# وقتی بخواهی رابطه بین خوشه‌ها را ببینی
# نیازی به cdntroid نداره و برای داده های کوچک عالیه

# ❌ معایب:
    # برای داده های بزرگ خیلی کنده و حافظه زیادی مصرف میکنه
    # چون اول میاد تمام دیتاهارو دونه دونه از هم جدا میکنه
    
    
#===== sklearn =====
from sklearn.cluster import AgglomerativeClustering
model = AgglomerativeClustering(n_clusters=3)
labels = model.fit_predict(X)

# این n_clusters=3 یعنی در نهایت فقط 3 تا خوشه تشکیل بشه
# این fit_predict(X) همزمان هم fit میکنه و هم predict میکنه و label خوشه هر نمونه رو مستقیما برمیگردونه
# این مدل مرکز نداره بنابراین cluster_centers هم نداره





"DBSCAN clustering"
# Density-Based Spatial Clustering of Applications with Noise
# این مدل به هر نقطه ای که همسایه داشته باشه میگه core point و هر نقطه‌ای که پرت باشه میگه noise
# بجای اینکه مثل KMeans بگه مثلا 3 خوشه داشته باشیم، میگه هر جا تعداد زیادی نقطه کنار هم باشد، یک خوشه است
# الان 🟢 دیگه یک خوشه نیست و noise هست چون یک نقطه تنها و دور افتاده است ولی 🔵 یک خوشه و 🔴 یک خوشه دیگه هست
# 🔵🔵🔵🔵
#    🔵🔵         🟢

#  🔴  🔴🔴
# 🔴🔴🔴🔴🔴

# مدل DBSCAN هرجا noise باشه یه خوشه حساب میکنه
# هروقت با این مدل کار میکنه نیازی نیست تعداد خوشه رو بدونی


#===== sklearn =====
from sklearn.cluster import DBSCAN
model = DBSCAN(eps=0.5, min_samples=5)
labels = model.fit_predict(X)

# پارامتر eps شعاع جست‌وجو رو برای مدل مشخص میکنه و مدل توی این شعاع دنبال همسابه میگرده
# این پارامتر min_samples مشخص میکنه حداقل چند همسایه داخل شعاع باید باشه
# مثلا اگر مقدارش برابر 5 باشه اگر 5 همسایه پیدا شود این نقطه هسته خوشه است


# خروجی به اینصورت میشه (1- یعنی noise):
# 0
# 0
# 1
# -1


# ✅ مزایا:
# داده پرت یا noise رو پیدا میکنه
# تعداد خوشه نمیخواد از ما
# داده های غیر کروی هم پردازش میکنه

# ❌ معایب:
# انتخاب eps سخته
# چگالی خوشه‌ها اگر متفاوت باشه عملکرد ممکنه ضعیف باشه

    
    
    




"Gaussian Mixture Model (GMM)"

# مدل KMeans میگفت این نقطه در خوشه 1 قرار داره
# ولی GMM میگه این نقطه 80 درصدش در خوشه 1 و 20 درصدش در خوشه 2 قرار داره. یعنی احتمالی کار میکنه
# وقتی مرز خوشه ها واضح نباشه میشه ازین مدل استفاده کرد

# الان در مثال زیر KMeans اجبارا میگه نقطه ● برای خوشه X هست
# ولی GMM میگه 50% برای خوشه O و 50% برای خوشه X
# OOOOOOOO
#      ●
# XXXXXXXX


#===== sklearn =====
from sklearn.datasets import make_blobs
from sklearn.mixture import GaussianMixture
model = GaussianMixture(n_components=3, random_state=42)
# n_components -> تعداد توزیع‌های گاوسی (در عمل معمولاً همان تعداد خوشه‌ها)

x,y = make_blobs(n_samples=300, centers=3, random_state=42)

model.fit(x)
# مدل پارامترهای هر توزیع گاوسی (میانگین، کوواریانس و وزن هر خوشه) را از داده یاد می‌گیرد

labels = model.predict(x)
# برای هر نمونه، محتمل‌ترین خوشه را برمی‌گرداند

prob = model.predict_proba(x)
# احتمال تعلق به هر خوشه. خروجی شبیه این میشه:
# [[0.95, 0.05]
#  [0.40, 0.60]
#  [0.10, 0.90]]
# نمونه اول: ۹۵٪ احتمال دارد در خوشه ۰ باشد
# نمونه دوم: بین دو خوشه مرزی است (۴۰٪ و ۶۰٪)
# نمونه سوم: تقریباً مطمئنا در خوشه ۱ قرار دارد


























































